[
    {
        "username": "ACoAAEzn-WwB6G6u-KdMQIKRq8nXwQd64K1kaFQ",
        "author": "Nikhil Thakkar",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205611309596311554?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205611309596311554%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            0
        ],
        "description": [
            "🎉 Exciting Update! 🎉\nI'm thrilled to share that I have successfully completed the Python Fundamentals course from Great Learning! This journey has been incredibly rewarding, and I've gained a solid foundation in Python programming.\n\nAdditionally, while I have been diving into Golang as well, I'm continuing to make great strides in Python as part of my academic curriculum. Balancing both languages has been a fantastic experience, allowing me to broaden my programming skills and knowledge.\n\nLooking forward to applying these skills in future projects and continuing my learning journey! 🚀\n\n#GreatLearning #Programmingwithpython"
        ]
    },
    {
        "username": "ACoAADSXk-0BA8g0ohwiNhtCZA6vH-2Q8TO1qEE",
        "author": "Shrutakirti Chakraborty",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205595358544945153?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205595358544945153%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            2,
            10,
            2,
            1,
            8,
            10,
            38,
            15,
            20,
            7,
            1,
            6,
            499,
            15,
            4,
            9,
            5,
            5,
            17,
            8,
            12,
            16,
            11,
            3,
            5,
            3,
            7,
            0,
            2,
            2,
            1,
            0
        ],
        "description": [
            "Deploying a GoLang application on an Ubuntu server can be a challenging task. After working with GoLang for several months, I encountered difficulties with deployment. Despite extensive web searches, I found limited resources on this topic. Determined, I dived into the documentation and meticulously researched various blogs. Finally, I successfully deployed my first backend application on the server 🎉.\n\nIf you need a step-by-step guide for deploying your GoLang app, feel free to DM me! 🚀✨",
            "🚀 Hey amazing connections! It’s been a while since my last update – I’ve been fully immersed in the development of my biggest project yet! 🌟 Over the past three months, Samrat Mukherjee(Web3) and I have been hard at work on the testnet for Perpetual Trading of Defipe. 🛠️\n\nFrom tackling challenging problems and complex calculations to fixing server issues and squashing production bugs, it’s been a wild ride. 🎢 We’ve also poured our hearts into creating a stunning front-end UI with awesome animations. 🎨✨\n\nThe toughest nut to crack? The order book – but we did it! 💪 The development is now complete. Stay tuned for the launch, where I'll be sharing all the behind-the-scenes details of our journey. 📜\n\nCatch you soon for more exciting updates! 🚀 #Defipe #PerpetualTrading #TechJourney #StayTuned",
            "Samrat Mukherjee(Web3) #Kudos I really appreciate the guidance you provide me with #AmazingMentor",
            "Web3 startup laughing in the corner 🤣",
            "Thanks to all folks to make it an interactive session. It was my first session as a speaker and it went insane ❤️",
            "Unlocking the power of decentralized finance with our newly deployed ERC20 token contract! 🚀 Built on Ethereum, our token adheres to the ERC20 standard, facilitating seamless and secure transactions. Join us in revolutionizing the future of finance! 💼 #Blockchain #ERC20 #DeFi #Ethereum #Crypto",
            "🚀 Had an incredible experience at the 24-hour hackathon hosted by NIT Rourkela! HackNITR Hackathon  💻 Our team poured our hearts into building 'Redo' – a revolutionary dating cum vibe sharing platform. 🌟 From concept to execution, we pushed our limits and learned invaluable lessons along the way. 📈 Grateful for the amazing connections made and the overwhelming positive feedback received! \nMy Team - Arnab Chatterjee, Shivam Shaw, Ishita Bej \n #Innovation #Teamwork #TechEnthusiasts #hackathon",
            "Here is a cheat sheet of commonly used OpenZeppelin libraries.\nHave you used any of these? 🤔 \n\n#OpenZeppelin #coding #solidity #ethereum #smartcontracts #blockchain #defipe",
            "Grateful for the opportunity to collaborate and innovate at ETHGlobal hackathon with my talented teammate, Samrat Mukherjee(Web3) Mukherjee! 🚀 Excited to wear this swag as a token of our hard work and dedication. Let's continue to make positive changes in the world through technology. 💡 #GlobaEth #Hackathon #Teamwork #Innovation",
            "🚀 Dive into the world of #SmartContracts! Here's a basic Solidity code ready for deployment. 🖥️✨ #SolidityCoding #BlockchainDevelopment",
            "Thrilled about the upcoming wave of crypto protocols from India! 🚀 Exciting times ahead as we witness the growth of the Indian crypto industry. 🌐 Imagine the possibilities when one of these protocols, like Defipe, becomes our own success story! 🇮🇳 Let's ride the crypto wave together! #defi #crypto #trader #web3",
            "🚀 Hey Amazing Connections! 🌟\nAre you ready for an exhilarating journey into the future of decentralized finance? 🌐💰 The Defipe team is thrilled to invite you to join us on an exciting adventure as we unveil our groundbreaking product - our very own Perpetual Protocol! 🌈💻\nTo give us your valuable feedback we are open for everyone's feedback-\nhttps://lnkd.in/gkEBzzxB\n#DefipeRevolution #DecentralizedFinance #InnovationUnleashed 🚀🌟",
            "Async and await",
            "Late-night hustle on defipe's UI update! 🌙✨ Excited to unveil the sleek new look soon. #UI #Design #defi #uxdesign",
            "Hello fantastic connections! 🌟 I'm thrilled to reintroduce defipe.io, a perpetual trading platform offering synthetic assets. 🚀share your thoughts through the feedback link below. 📝 As a cool bonus, those providing feedback will have a chance to win Airdrops once we launch our own cryptocurrency. 🎉\nlink- https://lnkd.in/gkEBzzxB \n#airdrop #perpetual #trading #futuretrading #dex #defipe",
            "Hello, wonderful connections! 🌐💡 Just a friendly suggestion for those diving into the exciting world of Web3, especially in the DeFi industry. It's incredibly beneficial to brush up on your math skills, including differentiation, integration, and probabilities. 📚✨ I recently delved into the fascinating realm of swapping algorithms while exploring Uniswap V2, and having a solid grasp of these mathematical concepts truly enhances the understanding. Happy learning! 🚀🤓 #Web3 #DeFi #MathMagic #uniswap #defi #defipe",
            "It's awsome to work on some different level technology where the docs are unrevealed. Gonna introduce an awsome feature with LinkedIn family soon.💗",
            "Ho, ho, hodl! 🎅✨ This Christmas, decking the halls with crypto gains and trimming the tree with altcoins. May your portfolios be merry and your transactions be fee-less! 🌲💰 #LetsDefiPe #christmas",
            "Diving into the dynamic world of tech at Google Dev Fest was an incredible experience! 🌐✨ As a full-stack developer, I immersed myself in the latest industry trends, innovative tools, and collaborative insights shared by experts. 🚀 The knowledge gained fuels my passion for continuous learning and elevating my skills to new heights. It was an awsome thing to explore it with my teammates Samrat Mukherjee(Web3) and Soham Saha .The best sessions were on deep learning, GenAI and entrepreneurship & startups.\n\n#googledevfest  #gdgkolkata #FullStackDeveloper #ContinuousLearning #TechInnovation\n#llm #entrepreneurship",
            "Hey connections, the new Dark theme UI of DefiPe is live now ❤️. I request you to give honest previews on the new UI Upgradation. \n\n#UI #uxdesign #ai #defi",
            "Hey connections, My own portfolio web app is comming . The most interesting thing is that I have made it on newly learnt framework next.js . It's awesome experience to work with next.js. Each features impress me . soon I will share the web app link with you guys  ❤️\n\n#nextjs #reactjs #fullstackdevelopment #developer #figma",
            "Working on the new UI update of defipe.io . I am just loving it to develop it  for the users. If you have any suggestions on the new UI pls feel free to donate them ❤️\n\n\n#ui #design #web3 #web3community #ethereum #blockchain #decentralizedfinance #ai",
            "AI integration in defipe.io comming soon. Work is going on with full speed. AI features will be available soon in the future days ❤️",
            "I’m happy to share that I’m starting a new position as Chief Technology Officer at DefiPe.io!",
            "Hello everyone... After a long time I am sharing my journey.\nActually I am working in a full-time startup so can't share the things out. \nSo basically this post is based on one of the major feature of my startup.\nI designed the backend of a chatbot by using openAI API. It's a great success to complete the chatbot project for my startup journey. \n#startup #chatbot #openAI",
            "Welcome to DefiPe.io - your gateway to seamless crypto trading. Explore secure transactions on our platform and empower your digital asset interactions with our social crypto link wallet. Join us in shaping the future of decentralized finance.\n\nLet's Visit Our Site 👉defipe.io\n\n#DefiPeio #defi #cryptocurrency #cryptonews #crypto #cryptotrading #cryptocommunity #btc #cryptoinvestor #cryptorevolution #ethereum #elsalvador #uk #hongkong #uae #finance #india #worldcoin #xrp #web3 #web3community #blockchaintechnology",
            "hey my connections,\nI am glad to expose my diploma's major project infront of you guys. Its a mail server which is mostly based on crud operations of node.js . tech stack used in this project is MERN. Simple algorithm is used for this project. The interface is fully customisable for the users. the overview is given in this video. The working of the mail system will be given in the next video.\n\n#nodejsdeveloper #mernstack #fullstackdeveloper #majorprojects #mailserver",
            "Hey! all my connections, I was designing an api in node.js with connection to MongoDB. I faced an problem of not accepting callbacks by Mongoose. then I came to know than new version is not accepting some call back functions. after a while I write the code by async function and which is successfully working. I hope it will help if anyone faces same kind of problem ❤️.\n#nodejs #mongoose #mongodb #api",
            "Hello ! linkedin community, this post is based on my first real time chat app(no private chat room). I have done this project with socket.io and node.js . Its awesome experience on working with socket.io .\n\n#node.js #socket.io #webdevelopment  #chatapp\n#webdev #linkedin #project",
            "After the backend (node.js) it's now time for some frontend Library of JavaScript(react.js). #javascript #frontend  #react #jsx #node",
            "Small Internship under forage #forage",
            "Hi everyone - I am looking for a new role and would appreciate your support. Thank you in advance for any connections, advice, or opportunities you can offer. #OpenToWork"
        ]
    },
    {
        "username": "ACoAAADMneMBBa50zRvV0IyArEr5UWNfxUqsZoQ",
        "author": "Brandon Harrell",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205616723943636993?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205616723943636993%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            1,
            2,
            3,
            9,
            2,
            10,
            5,
            0,
            4,
            1,
            2,
            2,
            3,
            6,
            6,
            1,
            3,
            4,
            27,
            8,
            6,
            2,
            4,
            3,
            1,
            2,
            1,
            2,
            6,
            1,
            1,
            3,
            7,
            9,
            3,
            6,
            9,
            4,
            4,
            6,
            19,
            2,
            3
        ],
        "description": [
            "I have to say I love Go because I feel Go literally saved my career.  In 2016 I left Comcast where I strived for several years.  Had I stayed I would have had an amazing data engineering career.  But I decided to move into DevOps.  And that is where I found and picked up Go.  \n\nBut what Go did for me is kind of taught  me about how to rethink programming.  I came up in the Java world.  Java was full of frameworks and ceremony.  And there was a \"Java mindset\".  You had to take on an abstraction first approach to software design. \n\nGo didn't do that.  It actively penalized you for an abstract first design.   Go also got me closer to the hardware.  I don't consider Go a low-level language.  Clearly with a GC it can only be so performance.  But it is the lowest level high level language I've seen.  There could be other examples (like Nim), but Go set the standard.\n\nSo I've learned how to do things like write buffers, flush my i/o, sync data to disk.  It has also helped me better understand HTTP as a protocol and TCP as well.  Who writes TCP listeners in Java?  You do it all the time in Go, and it's not that hard.\n\nI use to think I was a genius coming up with all of these crazy abstract patterns in my Python and Java life.  But now l know less is more.  When I go on projects and I see Go-Java or Go-Python or even Go-Haskell (yeah I've seen this before) from developers who left a project (and now I need to take over the code base), I just shake my head and remember this was me at one point.\n\nAnd I like the fact that Go is influencing programming language design.  I've seen new languages like Nim, Zig, Odin, and Rust (it's as simple as it can be for what it's trying to do).  And I see the future of software engineering.  I think we can understate how Go is influencing the market.  And I think we have to thank how much it took from C.\n\n#Golang #Clang #nim #rust #softwaredesign #java",
            "Spend some time on implementing a B+ Tree in Zig.  Still on the fence about just doing it in Rust.  But I had to basically roll my own little endian binary encoder, which wasn't too bad honestly.  I probably will have to implement my own writer as well.  Zig does have a library called \"readInt\" and \"writerInt\", but I can never get it to work.  Integer casting is annoying, but can't lie.  However bit it exposes me to bit shifting. which honestly I've rarely had to do in my career.  Speaking of which, could Zig be good for IoT especially on the edge?  hmm.",
            "Ok so I actually started to implement my database from scratch last night in Zig.  And well it’s fun.  But zig is only on version 0.12, so it’s in a pre 1.0 release.  That means the standard library is prone to change and I see that things changed drastically from other versions of Zig.  \n\nTo create a database I will have to create a MMAP and persist it to disk via fsync which is a syscall.  Like Go there is an attempt to abstract it away.  But as it stands they don’t see to have a fsync implementation for Darwin (which I developed on).  And I don’t want to have to deal with VMs m.\n\nSo I think I’m going to decide to implement it in Rust.  While I like Zig more I think Rust has the maturity I need.  Unfortunately I’m dreading dealing with the borrow checker semantics and its ownership model which is confusing. \n\nAlso I have to hand code littleendian in Zig.  Which is fine but the way how unsigned integers work and casting rules is a bit confusing.  Since I would have to declare a u8 then but shift for unsigned int64.\n\nOh well let the journey begin (again)\n\n#rustlang #zig #ziglang #database",
            "2nd week unemployed, and man what a brutal brutal week.  Every opportunity I had pretty much lead to nowhere.  and I had one of the worst interviewers on the planet.  I'm not playing the blame game, but I've been on enough interviews to know when the interviewer is purposely asking bad questions and trying to trip you up.  Anyway I can't cry over spilled milk.  Just have to hope next week is better.\n\nAnyway this weekend I'm excited to start building my own database from scratch using either Rust or Zig.  I feel it's going to be a lot of fun.  It's a great way to learn new skills.\n\nI know I should be grinding leetcode.  But I find leetcode boring.  And all of the concepts like Trees, List, hashes, and efficient runtimes are all concepts you will deal with in building a database.  Plus it was an interview question, and I'm ashamed I got it wrong because I've been wanting to build a database for years.   This is something I'll be doing in between interviewing and reading rejection emails/DMs lol.\n\nAnd to my people, because I consider all develpers my people.  Happy weekend, and happy building!\n\n#ziglang #golang #rustlang #rust #zig #database #BTree #BPlusTree #datastructures",
            "To my network.  This unemployment stint (albeit only 2 weeks at this point) has empowered me.  I need to know what are the common AI powered resume scanners or AI recruiting tools.  Are theee usually secrets or serve as the baseline for proprietary software?  I know some AI searches are based on ATS.  Or are ATS things that agencies subscribe to?  I don’t usually market myself as this because I’m not qualified.  But I do have some data science skills and I figured I should put them to work since I got time on my hands",
            "On my timeline I am seeing a lot of developers who are frustrated.  The entire hiring process and the loops that one must jump when dealing with recruiters and hiring managers.  I just wanted to say this, don't give up on this amazing career.  A few years ago the field of software engineering was plentiful.  I remember being unemployed in 2018, and a week later I had like 3 offers.  That was the market back then.  But all markets slow down, and our market is at a crawl.\n\nMe personally, you can reject me 1 million times.  I'm committed to this craft.  I'm dedicated to continuing to learn and level up.  It's what I do, and it's what I do best.  And I believe, no I know I'm a good software engineer. \n\nWe also have to realize that software engineering as a profession is broken.  From the hiring practices, to the project management, and everything in between.  That is why every few years we always have to fix it with things like Agile, Scrum, SaFE, Kanban, etc.  And FAANG has had both a negative and positive impact on the market as whole.\n\nBut with that said, always be the change you want to see.  Just because a billion people tell you the sky is green doesn't change the fact that it's blue.  Always do what's right.  Always build and engineer and solution with integrity.  One day the chips will fall, and the house will come crashing down.  Will you be on the right or wrong side of the equation?",
            "Has Golang created a revolution in programming languages?  When Go was created it kind of went against the grain.  It decided to be minimum, steer away from common conventions on OOP and functional programming.  It was verbose in not very expressive.  And it was kind of umm boring.\n\nIt was a stark contrast to a lot of the JVM languages that had started to get popular like Scala, Clojure, Groovy, etc.  \n\nNow we are seeing a lot of languages that are doing similar things to Go. Rust obviously shares a lot of similarities in that it decided to move away from classes, leaned more towards composibility, and has value based error handling.  Now we see other languages like Zig and Vlang with a similar strategy.  \n\nI believe for years the systems programming space was settled matter.  You either were a C\\C++ developer, or you tried to make it work with Java.  But there was really never anything else.  I’m glad Go gave us a simple but powerful language not seen since C.\n\nI’m very glad I started my Go journey early.  And I’m really excited for the future of programming\n\n#golang #vlang #ziglang #rustlang #java",
            "Alright in my attempt to write a message broker from scratch, I decided to learn Zig.  Zig is a language that has manual memory management and no garbage collector, which is necessary for building a tool like a message broker.  Plus Go already has a cool message broker called nsq.  Anyway I created a TCP server in Zig just to see if I can get comfortable in the language.  I document my journey here\n\n#ziglang #golang #broker #nsq",
            "In order to vent, I decided to write an article regarding my brutal rejection Monday.  And how I plan to use that to improve my skillset.  I actually do love to blog, but kind of never had anything to really blog about.  So this is a nice thing to journal",
            "Neovim is pretty fun.  I’ve always flirted with the idea of just using modal text editor instead into of an IDE.  I come from the Java enterprise world in the 2000s.  And I clunky IDEs were simply what you accepted back then.   In 2013 I made the switch from Eclipse to Jetbrains IntelliJ and have not looked back.  \n\nBut unfortunately some jobs I work cheap out on laptops.  So loading Goland can be quite a chore.  And it’s compatibility on Apple silicon can be hit or miss. \n\nSo in my journey in trying to pick up Zig I decided to learn it via neovim.  I have only ever used Vi or Vim for simple text editing and maybe some simple scripts.  Never considered it for large projects.  So far I’m having a lot of fun\n\n#neovim #ziglang #vim",
            "For the first time in awhile I have no interviews lined up.  So I think today I am going to try to learn about #ziglang.  I don't know much about the origins of this project.  But it's a more systems level language that claims to be simple.  I know Rust can be very difficult to grasp with its borrow checker, and ownership model.  But Zig has a concept called \"allocators\", and it has the \"defer\" keyword.  Very Golang like.\n\nLow level programming is definitely my first love.  Though I think I'm a pretty serviceable backend engineer.\n\nI may actually decide to try to write my \"Kafka clone\" in this language instead.  I also decided to try to get away from clunky IDEs. And bit the bullet and setup a nevovim environment for myself.\n\nI'm going to try to implement a TCP socket client and server.  And maybe even a chat server today from scratch.  One of my favorite things to code up in Go.\n\nhttps://ziglang.org/\n\n#ziglang #rustlang #golang #kafka #tcp #chat",
            "I think what frustrates a lot of people about job searches is that you're often at the mercy of someone else.  Be that the recruiter, hiring manage, HR personnel, or even the interviewer.  Everything just seems out of your control. It's like you can't take your destiny in your own hand.\n\nOnly person you can control is yourself. And the only thing you can really do is level up honestly.  Just show up to an interview, and put yourself in a situation to be the best person they've ever seen.  The best you can do is strive towards being the best",
            "Well had a pretty upsetting rejection today.  Had pretty high hopes but ultimately lead to nothing.  I can put it all on the employers or the interviewer.  But they were more or less pretty good.  So only person I can control is myself.\n\n  The issue is that I didn’t show up to the interview as the best candidate.  The reality is as senior/prinical engineers we are competing with the best of the best.  The level and intellect a senior engineer could know is basically unlimited.\n\nAnd yes as we’ve enjoyed many years of property and success in our roles.  But maybe that has just lead us to think we’re better than we actually are.  Maybe we’re not good enough because we haven’t had to be good enough due the the past market\n\nWith that said I’m definitely not good enough.  Yes there is a lot of stuff I already know.  But there is an infinite amount of things I still have yet to learn.  \n\nI was asked today to build Kafka.  And I was rejected because whatever design I had wasn’t sufficient.  So with that said I’m going to dedicated my time building Kafka.  I am going to study the source code and reimplement it\n\nI could do it in Go but once I understand it I think Go would be too easy.  So I’m going to implement it in Rust.  And I need to get my commit messages up anyway.  Once I have a proof of concept I am just going to open source it \n\n#kakfa #golang #rust #datastreaming",
            "Well first week of being unemployed.  And somehow I've never been busier.  Between tons of interviews and take home exams, and leet code grind, and upskilling.  I feel I'm a lot busier now than I was when I had a job.  Except I'm like not getting paid.  The saying \"looking for work is a full time job\" has never been more true.  Anyway got some pending homework assignments that I hope to square away this weekend.",
            "Well it’s official.  I’m no longer employed.  Not exactly sure how I feel about it.  I mean I’m not sad about it to be perfectly honest.  I’ve been in this industry for so long that I’m hardened by it.  Kind of feel I’m ok as long as I have a laptop and an internet connection.  I can just kind of make things happen. \n\nWith that said. Look forward to stumbling on DSA interview questions.  Actually during interviews is when I come up with my best ideas because of some of the problems I’m presented with.  And let’s see how good my algorithmic thinking is now.\n\nShould I bother to grind leet code or should I upskill?  That’s the question.  Part of me just want to play with distributed systems problems like BFT consensus.  \n\nAlso a big part of me want to building my own key/value store based an LSM Tree.  And create my own Raft consensus. Which is a use case I’ve been wanting to use Rust for (though I could use Go).  So skies the limit.\n\nActually I’ve been paying for leetcode dor like 3 years and barely use it.  So yeah maybe I should actually use it for once lol\n\n#leetcode #lsmtree #golang #rust #upskill #opentowork",
            "A lot of people may not know this.  But kubernetes has its own garbage collector.  Taking a lot of terminology from Java’s garbage collector like “finalizer”.\n\n  I think this is always a cool concept.  I’ve encountered these problems when deleting a resource thst required a cascading delete creating orphaned resources.  This is definitely behavior that should be understood especially when dealing with controllers.\n\nThis article is a great overview.  As a kubernetes developer you’re not super likely to encounter these problems directly.  But it’s nice to understand this behavior in case you do\n\nhttps://lnkd.in/eY9pF4JQ\n\n#kubernetes #garbagecollectors #kubernetescontrollers",
            "As someone who uprooted himself and moved back to Atlanta to take of his mother.  I made a conscious choice of spending the last year of my mother’s life with her and being there for her instead of going gung ho for a career.  I’m glad I made that decision.\n\nWith that said always put the people you love first.  Companies will make a decision about you and it’s not necessarily anything you can take personally.  \n\nHowever I must say I’ve worked weekends and holidays on problems.  Not because I thought it make me look good.  Or that it was going to give me more money or make my boss like me more.  It is because I genuinely was intrigued by the problem and I had fun solving it. \n\nAnd I think that’s an important distinction.  Love what you do.  And find engaging work.  Staying up late building data pipelines, or writing kubernetes operators, or solving Kafka problems wasn’t so my boss could love me.  It was because I found it cool.  And I love learning new things.  \n\nThe last thing you want to do is have your boss take you off the cool stuff and do maintenance development.  Maybe this isn’t the most mature post.  But I wouldn’t be in tech if I didn’t think it was cool and fun.\n\n#worklifebalance #technology #kafka #golang",
            "Since I will be out of work soon. I figured this is probably the best time to up skill. While employed it can be hard to learn additional skills outside of your current job. Because there are only so many hours in a day. So at times like these I may as well learn something new.\n\nI am really into distributed systems and the blockchain. And have been since around 2014. Unfortunately due to how busy my career has been these last 10 years, I've never taken the time to learn proper blockchain development. So here is the time.\n\nI actually have been wanting to really learn Rust. And I've been wanting to dig into a smart contract language. Sorry EVM and Ethereum just doesn't seem pleasant to me. I am going to take the dive and learn Solana. Which kind of kill 2 birds with 1 stone. I get to use Rust in a practical way. And I get to build my skillset up for smart contract development.\n\nCosmos and Tendermint are probably 2 additional things I want to learn\n\n#rust #solana #blockchain #distributedsystems #upskill",
            "To my network.  My contract will be coming to a close after this week.  And I would like to reach out to my network.  I’m a senior Go developer with 8 years of Go and 10+ years of Python.  My specializations are Event Driven Architectures and Microservices.  I also have extensive cloud experience with 10+ years in AWS.  And I’ve been working with containerized applications since virtually the beginning of time.  Basically I started Docker in 2015.  I’m also pretty good with Kubernetes.  I probably won’t be changing my OpenToWork status until after a week.  Anyway the market is bone dry but i figured  I would give this a try \n\n#Golang #kubernetes #AWS #Cloud #opentowork",
            "After a long career in tech.  I’ve come to find that the tech market works in cycles.\n\nIn the 1950s the tech industry technically began with Fortran as seemingly the first professional language.  And it became so complex that having a deep understanding of of computing became essential to use it.\n\nHowever business wanted their business people to be able to write their own software.  So they created a business friendly language called COBOL.  But fast forward to the 60s and 70s and COBOL programmers are not only programmers but they are demanding very high salaries.\n\nFast forward to the 80s and the invention of 4GLs came into tue industry.  These were simple languages (mostly based around basic) with supporting databases.  SAP was a big example of this.  But you have other competitors like dBASE and FoxPro.\n\nThen in the 90s the trend became Rapid Application Development (RAD). You had things like C++ Builder,Delphi, and the kind of them all Visual Basic.  VB being the JavaScript of its era.  \n\nThen we got Web 2.0 and WYSIWG editors.  Now we have low code and no code.  Also AI.\n\n  People are always trying to disrupt the tech industry with something.  But in each of these attempts to do so has only reinforced why you need developers.  Or it has created a new generation of developers and made them even more in demand.\n\n  I’m convinced software engineering will never go away.  But it will continue to evolve with each new paradigm that gets introduced.\n\n#history #ai #4GL",
            "Anyone in my network definitely reach out to Musa.  He has a lot of front end and JavaScript experience and is very eager to join any project and contribute.",
            "Communicating Sequential Processes or CSP is a concurrent model proposed by Tony Hoare in 1978.  It is also the foundation for concurrency in Golang.  As Rob Pike said this was in inspiration for his model when he created the Go programming language.\n\nI've always known about this paper but I've never tried to read it.  It is an interesting read, and he takes a lot of concepts for Djikstra which I wasn't aware of.  What I really like is the section where he talks about commands and how to compose them to solve issues.\n\nI think the thing here that has the most real world correspondence is his section on monitoring and scheduling.  The Golang scheduler is actually a major thing to understand when it comes to optimizing Golang applications.  \n\nAnyway worth a read.  It's a pretty dry read, but pretty interesting nonetheless.  It uses a lot of BNF notation which is annoying (not a fan).\n\n\n#golang #concurrency",
            "Wow sad news and very shocking.  Pretty big blow to the CNCF community as Weaveworks was once a major player.",
            "One of the frustrating of Golang development is that while it has its coding standards, for developers starting out it can be hard to know what idiomatic Go is and what it looks like.  Go really allows you to write complex and unreadable code.  And a lot of times these are valid patterns in other languages.  This leads to a lot of code smells in production code bases.\n\n A lot of people who work with Go says go should be \"simple\".  But simple can be very subjective.  One thing I can say I miss about working with Python is PEP8 and a sense of \"pythonic\" and \"non-pythonic\".  While not perfect it does give developers a good set of guidelines to what idiomatic code should look like in Python.\n\nEven after 8 years with Go, I'm still not entirely confident about what idiomatic vs non-idiomatic Go looks like.  I have a \"sense\" of it, but it's hard to say objectively and authoritatively.  I will say there are common patterns and code smells that will often get you in trouble.",
            "A common Golang anti-pattern is interface pollution.  This is more common than you would think.  Especially since many shops move from abstract heavy languages like C# and Java to Go, there can tend to be an over reliance on interfaces.  Also compounded with the fact that many people use interfaces to for mocking means people tend to over rely on them.\n\n  However interfaces can make code unclear.  And it can lead to code indirection.  Especially when there are only single implementations.  You can also introduce potentially a lot of runtime behavior.  Unfortunately a lot of official libraries abuse interfaces.\n\n Here is an article written by Ardan Labs talking about this.  \n\nhttps://lnkd.in/edbN8yw4",
            "Configuration management is a make or break for any sort of large scale application.  Getting configuration management wrong can really make adding features to your systems very tedious and error prone.  There is a reason why there have been so many tools designed to attack this problem.\n\nFrom tools like CFEngine, Puppet, Chef and Kubernetes with configMap, or remote configuration options like ETCD and Consul.  It's also one of my biggest pet peeves.  And something I'm very passionate about\n\n  With that said I just recently discovered Expr-lang.  It was written in Go, and it's an expressive and query language for dynamic configurations.  Definitely plan on using it on some personal (and possibly professional) projects in the near future.  This type of stuff gets me very excited of the possibilities of designing an architecture.  And it seems to be in common use in some very large companies including Google.",
            "A lot of people complain about error handling in Go.  And many have proposed a lot of solutions to deal with it.  But I think people miss the point of error handling in Go.  It’s very explicit.  If you are handling all of your errors as you should, then tracking down errors should be easy.  It creates an easy to follow call stack.  I know it is tedious.  However I will say with tools like co-pilot it’s really not that bad.  \n\nIn code reviews never be afraid to call out people who skip errors or complicate them.  Behind some crazy bugs in Go there is always bad error handling",
            "Can’t lie.  2023 really sucked.  I lost my mother who was honestly my best friend.  And career wise I had a few bumps in the road.  I will say I there are some good things at the end of 2023 that I hope materialize in 2024.  I want to do more writing and I definitely want to do more AI projects.  I’m also a huge advocate of neuromorphic computing and IoT so let’s hope to see where the field goes in 2024.  I’m very hopeful.",
            "Golang 1.22 will add an interesting new feature.   This is actually the first breaking change (that I can think of) to the language.  The introduction of loopvar.  Which change the behavior of capturing values in a loop.  This will be an interesting way to write concurrent code, since this is mostly seen in code that uses go routines.  And in effect uses pointers.  This could be a good optimization.  I do like the fact that this was feature flagged, similar to how Go modules was feature flagged back in Go 1.11.\n\n  I think 2024 will be an exciting year for Golang.  I love how uncompromising the Go team is when it comes to the design philosophy of the language.  They aren't just turning it into C# and Java.",
            "The world of LLMs are interesting.  I read the 2017 Paper \"Attention is all you need\".  And at the time it seemed like a logical progression in the field of NLP.  But I just discovered literally last week that some LLMs allow you to fine-tune them.  Basically create a model of a model.  And then I wondered if I could use an LLM to create a coding model.  And yep there is.  It's called Starcoder.  Which is new to me.  I actually read their paper about how they created the dataset and model.  It's an interesting read.  Only takes about 15 minutes\n\nThis paper even has a cool name \"May the source be with you\".  Nice touch. As someone who loves data engineering I love reading about data curation.",
            "As a distributed systems enthusiast and someone who loves databases.  I often look at B+ tree data structures.  Balanced trees are quite pervasive in the design of database storage.  \n\n  I have been a fan of badgerDB which is a pure Go key value store.  And it uses skiplist instead of the tradition B+ tree or even the more popular LSM Tree.  Anyway I found this article that gives a good comparison of skiplist and balanced trees.  Skiplist are good for concurrent access due to the lack of a rebalancing operation.  Where rebalancing in balanced trees require aggressive locking to avoid any deadlocks\n\nAnyway this paper is a good read.  Highly recommended",
            "Not going to lie.  I’m pretty bullish on neuromorphic computing.  It provides a good alternative to Von Neumann architectures.  And I think it would be very cool if we were able to utilize a synapse based model.   But the question is as a software engineer how do we write software to work with neuromorphic computing?\n\nI think it’s as important area of research as more applications start to target this sort of hardware.  I started reading this paper published last month about NIR (Neuromorphic Intermediate Representation).  What appears to be a unified instruction set for neuromorphic computing.  It’s a very interesting read",
            "I just really started to incorporate the power of generics in my GoLang code.  I used to be against Go getting them because I remember how much more complex it made Java.  But I quite like how much power it gives me from a code design perspective.  I still think it’s usage should be limited to libraries.  Kind of feel like a kid with a new toy.  \n\n  I also think it eliminates the need for “super structs”.  Structs they embed so many types that it creates too much deep nesting.  I can just create an interface and include various struct types. Then constrain them to my functions or other structs.  The modeling flexibility it gives me is pretty nice.  It’s one of the things I’ve always envied from Rust developers\n\n  Anyway I’m having a lot of fun",
            "I’m fortunate to still be in the job market and make an income.\n\n  But I know GoLang at a high level.  Distributed Systems.  Microservice and Event Drive architectures.  Kafka.  A dozen NoSQL databases.\n\n  Consensus protocols like Raft and PBFT.\n\n  Have 10+ years working at Amazon.   Have actually built clouds myself.\n\n  I know OCI, all container technology.\n\n   I feel I study more than I eat.  Or leave the house.  \n\n  And I still feel that I could never keep up in this job market.  Even if could speak to and prove my experience in all the above.\n\n  We have reached an impossible market. \n\n   Specialization is dead.  You either know everything or you know nothing at all.  In terms of tech roles we are on the verge of technological convergence \n\n  There will be no seperate roles or jobs.  There will only be one role and one job.  All roles will become one.\n\n   The real question is how do you even keep up?  If I knew the answer to that question I would be a millionaire lol",
            "In 2014 or 2015 I was introduced to elasticsearch.   I absolutely hated it at first.  At this point in my career I was so use to RDBMS systems.  And elasticsearch query system didn’t make a lot of sense to me.  Then I learned about elasticsearch and I learned to love it.  As a matter of fact it is my favorite data store.\n\nToo bad my career journey mostly lead me away from elasticsearch.  I think a lot of concepts in elasticsearch like term vs fuzzy searches.  And N-Gram are so relevant today.  Especially in the world of NLP and LLM.\n\nElasticsearch was also the first product I used that introduced me to more advanced concepts in distributed systems.  Such as voting for leaders of a cluster.  \n\nUnfortunately elasticsearch is so expensive to run, and is very heavy.  In addition just requiring a lot of specialization to be able to scale its performance.  But it’s a great platform for data geeks like myself.\n\n I wish there were comparable products written in Go and Rust because I’m still not a fan of the JVM",
            "Everyone is talking about how bad the market is.  But is anyone really surprised.  We’ve been a pattern of hyper growth.  And we’ve thrown way too much capital at way too many things.   \n\n  This was never going to last forever.  Now is the time for real business leaders to make a mark in the market.  I feel there will be many people in need soon, and hopefully those who are creative with principled business minds can step up.\n\n  I thought during the pandemic we would see an explosion in businesses.  But I think the market is correcting and it’s a healthier environment.  \n\n  Of course I think we’re at the start of the AI speculator bubble.  Let’s see how the market shakes out",
            "I don’t make many personal post.  Because LinkedIn is not the forum for that.  And I appreciate that.  On Saturday I finally had a memorial for my mother.  It has been a hard 2 months both personally and professionally.  And as an only child it’s alway difficult to ask others for help.\n\n  So one has to ask themselves.  What is your purpose?  I spent the last few years focused on my mother’s care.  But where do we go from here?\n\n I will say this.  I declare war on cancer.  As ridiculous as it sounds.  Before I die I want every cancer clinic shut down.  And every cancer surgeon, doctor, and specialist unemoloyed.   I want the idea of cancer to be as inconsequential as as the DoDo bird or a laser disc.  I want cancer to be the blockbuster of the 21st century.\n\n Fortunes has lead me to study neural networks and distributed computing the last 10 years.  So there has to be some way to use my skillset to come up with something.  I do know this is what my life will be from here on out.\n\n  I’m no data scientist or biologist.  But I do know that technology is the way.  And i like to solve hard problems.",
            "Most people who know me know that I really love distributed systems.  It’s a passion of mind.  Data problems are just so intriguing.  Especially in how you manage state across a cluster.  It’s probably why I have come to really like or at least appreciate Kafka and Kubernetes as products.\n\n  I’m an admitted database junky.  But I’ve been more concerned about the implementation of database engines than the database utility itself.  I spent the last year studying the source code of key value stores like levelDB, badger, and RocksDB.  Which are the storage engines for Consul, Bitcoin, etc.\n\n  I know my focus should be on building the latest social media network, or video streaming service.  But sometimes as a geek I can’t help myself",
            "I think there needs to be a differentiation between blockchain and cryptocurrency.   I think cryptocurrency has done a lot of harm to the integrity of blockchain development in general.  To the point where people don’t think blockchain development is very useful.\n\n  The reality is the concept of immutability is huge.  It has so much utility in privacy, auditing, and transparency.   It also is key in what I would coin digital “archaeology”.  The ability to have the immutable web is really really important and blockchain helps us achieve this.\n\n  Decentralization is still an area of research in computer science.  Remember that the Byzantine  General problem can’t full be solved without a number of trade offs. So there is still plenty of room for innovation here",
            "I’ve been familiarizing myself with consensus algorithms for the last few years.   I think they’re more important now than ever before.  As we rely on distributed systems for our daily lives it is important to understand how computer science is providing answers to these problems.\n\nI’ve started messing around with Hashicorp GoLang Raft library.   But I think it may be worth it to implement my own version for scratch whenever I find the time\n\nhttps://lnkd.in/gPuuNpBk",
            "Unfortunately after 4 years of fighting.  My mother lost her battle to cancer last Thursday.   My mother was laid off from a bear 25 year career at TWA in 1995.  And her layoff made her get into computers.  And she encouraged me to learn them shortly after.  I would go on to make a long career in tech.\n\n  She wasn’t just a parent but she was a best friend and a mentor.  She will definitely be missed.",
            "The New York Times A worker at a steel minimill in California. Minimill technology has enabled steel plants to cut 75 percent of employees over five decades, while keeping production the same. David McNew/Getty Images By CLAIRE CAIN MILLER December...",
            ""
        ]
    },
    {
        "username": "ACoAAA4ZPuQBTCPomiRLwc87lIHMHPw8p5lOeJs",
        "author": "Ajesh Mathew",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205615313596424192?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205615313596424192%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            0,
            0,
            1,
            0,
            0
        ],
        "description": [
            "Infoblox is looking for: SSE/Staff Multi Cloud Software Engineer (GoLang)",
            "Infoblox is looking for: Senior Cybersecurity Account Executive",
            "Infoblox is looking for: Business Development Intern",
            "Infoblox is looking for: Staff Resident Engineer",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Customer Service Representative",
            "Infoblox is looking for: Enterprise Technical Support Engineer",
            "Infoblox is looking for: Staff Data Engineer",
            "Infoblox is looking for: Senior Data Engineer",
            "Infoblox is looking for: Customer Development Representative",
            "Infoblox is looking for: Enterprise Account Executive - Tokyo/Osaka",
            "Infoblox is looking for: Software QA Engineer II",
            "Infoblox is looking for: Business Development Representative II",
            "Infoblox is looking for: Staff Enterprise TSE",
            "Infoblox is looking for: VP, Product Marketing",
            "Infoblox is looking for: Senior Solutions Architect I - Taiwan",
            "Infoblox is looking for: Commercial Account Executive II",
            "Infoblox is looking for: Customer Development Representative",
            "Infoblox is looking for: Senior Enterprise Account Executive - LATAM",
            "Infoblox is looking for: Sales Recruiter - Contract",
            "Infoblox is looking for: Senior Pricing and Licensing Analyst",
            "Infoblox is looking for: Escalation Enterprise TSE",
            "Infoblox is looking for: Inside Sales Support Specialist",
            "Infoblox is looking for: Senior Enterprise Account Executive I",
            "Infoblox is looking for: Senior Resident Engineer",
            "Infoblox is looking for: Senior Staff Product Manager",
            "Infoblox is looking for: Enterprise Account Executive - North China",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Principle Technical Alliances Manager",
            "Infoblox is looking for: Professional Services Consultant II",
            "Infoblox is looking for: Threat Researcher",
            "Infoblox is looking for: Product Security Specialist - SAARC",
            "Infoblox is looking for: Senior Solutions Architect",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Senior Enterprise Account Executive I",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Senior Major Account Acquisition Executive",
            "Infoblox is looking for: Senior Major Account Executive",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Senior Enterprise Account Executive",
            "Infoblox is looking for: Manager, Enterprise Support",
            "Infoblox is looking for: Senior Information Security Analyst",
            "Infoblox is looking for: Supervisor, Enterprise Support",
            "Infoblox is looking for: Professional Services Consultant II",
            "Infoblox is looking for: Senior Professional Services Consultant - APJ (based in Singapore or Australia)",
            "Infoblox is looking for: Senior Channel Marketing Manager II - APJ (based in Singapore or Australia)",
            "Infoblox is looking for: Staff Technical Marketing Engineer",
            "Infoblox is looking for: Technical Marketing Engineer II"
        ]
    },
    {
        "username": "ACoAADbnEwcBjpsK2FnHctvPjhCpCNG9BFTf0T4",
        "author": "Subha L🌻",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205615249222172672?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205615249222172672%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            0,
            0,
            0,
            0,
            0,
            1,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "description": [
            "Dear connections !!!!\nInfoblox is looking for SSE/Staff Multi Cloud Software Engineer (GoLang). Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Cybersecurity Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Business Development Intern. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Staff Resident Engineer. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Customer Service Representative. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Enterprise Technical Support Engineer. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Staff Data Engineer. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Data Engineer. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Customer Development Representative. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Enterprise Account Executive - Tokyo/Osaka. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Software QA Engineer II. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Business Development Representative II. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Staff Enterprise TSE. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for VP, Product Marketing. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Solutions Architect I - Taiwan. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Commercial Account Executive II. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Customer Development Representative. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive - LATAM. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Sales Recruiter - Contract. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Pricing and Licensing Analyst. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Escalation Enterprise TSE. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Inside Sales Support Specialist. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive I. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Resident Engineer. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Staff Product Manager. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Enterprise Account Executive - North China. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Principle Technical Alliances Manager. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Professional Services Consultant II. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Threat Researcher. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Product Security Specialist - SAARC. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Solutions Architect. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive I. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Major Account Acquisition Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Major Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Enterprise Account Executive. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Manager, Enterprise Support. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Information Security Analyst. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Supervisor, Enterprise Support. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Professional Services Consultant II. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Professional Services Consultant - APJ (based in Singapore or Australia). Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Senior Channel Marketing Manager II - APJ (based in Singapore or Australia). Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Staff Technical Marketing Engineer. Learn more or Jobvite a friend. DM for referral  ",
            "Dear connections !!!!\nInfoblox is looking for Technical Marketing Engineer II. Learn more or Jobvite a friend. DM for referral  "
        ]
    },
    {
        "username": "ACoAAAp2mu4BOKG2Poaj5RBtOTCZ77tNpN85E28",
        "author": "Bao Dang",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205589976120532992?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205589976120532992%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            0,
            0,
            12,
            11,
            8,
            9,
            3,
            0,
            0,
            6,
            1202,
            4,
            345,
            1,
            10,
            12
        ],
        "description": [
            "I usually work with realtime processing and monitoring so I totally agree witht the idea of notifying as a service. I personally leverage the advantages of RabbitMQ, MinimalAPI and SignalR to get my work done. Distributed scalable processing is also another interesting place to put the notifying on.",
            "My latest pet project to play with Go and LLM models.\n\nThe idea of this project is to summarize an multi chapter document structured by chapter numbers, title and content by using LLM services/frameworks like OpenAI (key required) or Ollama(yes, if you've already installed Ollama locally then it's total FREE to use with Mistral model)\n\nI designed to break each chapter in to chunks combines with a struct to store the info of title, and content so that can provide  a better prompt than send the entire document to LLL models.\n\nThis project has also covered the basic ideas of Golang such as using environment settings, concurrency with waitgroup and pointers.\n\nI am refactoring this project to modulize my code for reusable purposes. Also trying to move it into API (with Gin?) and put some configs to actively manage requests to LLM services.",
            "I’m happy to share that I’ve obtained a new certification: Python for Computer Vision with OpenCV and Deep Learning from Udemy!",
            "I’m happy to share that I’ve obtained a new certification: Learn DevOps: Docker, Kubernetes, Terraform and Azure DevOps from Udemy!",
            "I’m happy to share that I’ve obtained a new certification: The Complete Guide to Becoming a Software Architect from Udemy!",
            "I’m happy to share that I’ve obtained a new certification: AI & Machine Learning Bootcamp from Udemy!",
            "So proud of my friend and his team who built KiLM and ran a Kahoot competition with other giants LLM models! Great work Zalo team!",
            "Oqtane rocks!",
            "Oqtane rocks!",
            "Rust: Từ Một Dự Án Phụ Trở Thành Ngôn Ngữ Lập Trình Được Yêu Thích Nhất!\n\nTrong nhiều thập kỷ, các lập trình viên đã viết các hệ thống quan trọng bằng C và C++. Và giờ đây, họ đang dần chuyển sang Rust. Có mặt trong hầu hết các hệ thống lõi của Microsoft, Facebook, Amazon, Dropbox, Discord, Cloudflare,… Rust còn là ngôn ngữ được yêu thích nhất trên Stack Overflow trong bốn năm liên tiếp.\n\nhttps://lnkd.in/gj_TMnYt\n\n#Rust#SystemProgramming",
            "[𝐅𝐑𝐄𝐄 𝐑𝐄𝐒𝐎𝐔𝐑𝐂𝐄𝐒 - 𝐁𝐔𝐆 𝐁𝐎𝐔𝐍𝐓𝐘]\n\nWant to get into Bug Bounty? Here is a list of resources\n\n👉 A great introduction on how to get into bug bounty by Katie Paxton-Fear\nhttps://lnkd.in/eEf6b5AN\n\n👉 A list of bug bounty platforms by Bughacking\nhttps://lnkd.in/eQk9jk7M\n\n👉 A list of bug bounty programs by vpnmentor:\nhttps://lnkd.in/eECUuYgp\n\n👉 Want to apply to the Synack Red Team Artemis program?\nAn exclusive community open to security professionals who identify as women, trans and nonbinary people, and others who identify as a gender minority. See this link:\nhttps://lnkd.in/eD_XDm4j\n\n👉 Farah Hawa has a great video about bug bounty resources:\nhttps://lnkd.in/ea-Nn2KB\n\n👉 The Bug Hunter Handbook by Gowthams\nhttps://lnkd.in/eW6awYWU\n\n👉 A repo “AllAboutBugBounty” by daffainfo\nhttps://lnkd.in/evPuwGKZ\n\n🚨🚨 𝐒𝐇𝐀𝐑𝐄 - Do you know other resources? Please share them in the comment🚨🚨\n\n➡️ 𝐅𝐎𝐋𝐋𝐎𝐖 𝐌𝐄 on github for more pentest tips: https://github.com/CSbyGB ⬅️\n\n⚠️Disclaimers: \n*1 This is provided for educational and informational purpose only\n*2 Please note that the term \"pentesting\" (or \"hacking,\" \"bug bounty,\" \"red teaming,\" etc.) is used in a legal context as a type of intrusion test to identify vulnerabilities and improve security measures. It is not intended for malicious purposes but rather for the greater good of enhancing cybersecurity.⚠️\n\n#cybersecurity #cybersécurité #bugbounty",
            "Awesome low latency #5G technology!",
            "𝗧𝗵𝗲 𝗔𝘇𝘂𝗿𝗲 𝗖𝗹𝗼𝘂𝗱 𝗡𝗮𝘁𝗶𝘃𝗲 𝗔𝗿𝗰𝗵𝗶𝘁𝗲𝗰𝘁𝘂𝗿𝗲 𝗠𝗮𝗽𝗯𝗼𝗼𝗸\n\nI want to share with you an amazing resource that I found on GitHub through a reference post on LinkedIn. It’s a code repository for the book The Azure Cloud Native Architecture Mapbook, published by Packt📚\n\nThis book is a must-read for anyone who wants to learn how to design and implement cloud-native solutions using Azure. 🚀 It covers topics such as infrastructure, application, data, and security architecture, as well as cloud-native concepts, microservices, and service mesh technologies. 🙌\n\nThe code repository contains the code files for each chapter of the book, as well as PDF files with architecture maps that illustrate the key concepts and best practices. 🗺️ You can download them and follow along with the book, or use them as a reference for your own projects. 💯\n\nIf you are interested in this book, you can get your copy today from Packt’s website for free. 😊 And if you like it, don’t forget to share this post with your network. 🌟\n\nAll links in comments.\n\nI hope you find this resource useful and inspiring. Let me know what you think in the comments. Happy learning! 😄",
            "Totally agree! Issues need to be sorted out by best solutions not by best toys",
            "Dear my network fellows,\n\nMs. Su is looking for new opportunities and challenges as a professional developer with MERN stack. She also has impressive background in Banking/Financing section as a Financial Advisor at JP Morgan Chase Bank. If you're looking for new interns I highly recommend Ms. Su.\n\nThank you",
            ""
        ]
    },
    {
        "username": "ACoAABNBQfEBHTj58OcSS7XwC8IyuvTSu4ZY0s4",
        "author": "Pablo Tilotta",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205611620960473089?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205611620960473089%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            0,
            0,
            1,
            0,
            2,
            1,
            0,
            1,
            13,
            1,
            5,
            10,
            0,
            0,
            8,
            3,
            0,
            0,
            1,
            2,
            6,
            5,
            1,
            11,
            4,
            5,
            5,
            4,
            20,
            19,
            8,
            0,
            0,
            0,
            0,
            2,
            2,
            2,
            3,
            42,
            3545,
            3,
            0,
            0,
            2,
            0,
            2,
            1,
            0,
            0
        ],
        "description": [
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Prompt Engineering con ingenieros de la UBA desde 0\nPrompt engineer es la profesión más cotizada del momento. aprende Generative AI y obtiene sueldos altos\nhttps://pst.cr/VSDuu.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Lenguaje GO desde 0 !!\nToda la Sintaxis, estructuras y secretos del lenguaje GOLANG, desarrollamos un backend completo para una APP\nhttps://pst.cr/465aq.",
            "Ya catalogado por Udemy como \"Lo Mas Vendido\". furor por este curso \n\nSQL Server - Curso completo - de 0 a Avanzado [2024]\nSQL Server - TSQL - Crear Bases, Tablas, Campos, Indices, Tipos de Usuario, Funciones, Stored Procedures, Triggers, Azure, etc\nhttps://pst.cr/T5zAb.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nCurso Completo de Bases de datos - de 0 a Avanzado\nBases de Datos, MySQL, teoría y práctica, Lenguaje SQL completo, Base de datos MySQL, Diagrama EER, AWS RDS, Cloud\nhttps://pst.cr/QaFod.",
            "Ya hay usuarios finalizando y propagando sus certificados de finalización de mi flamante curso de SQL SERVER. \n\nCurso que no tiene ni 1 mes de lanzado y ya Udemy lo puso como \"Lo más vendido\" por sobre otros 10.000 cursos de SQL SERVER\nhttps://lnkd.in/dYgGBQHX ",
            "Esteban Tundidor - Director of Software Development de Mercadolibre te cuenta como es trabajar en ML y como aplicar para un empleo de IT.\n\nhttps://pst.cr/F6VJ3\n\nSi te gustan mis entrevistas, suscríbete a mi canal y seguiré subiendo material Premium para ti.",
            "Un capo Esteban Tundidor, entrevista muy interesante para todos aquellos que quieran conocer, como se trabaja en Mercadolibre, que deben hacer para aplicar y mucha data más... 1 hora imperdible",
            "Como es trabajar en Mercadolibre ? nos lo cuenta el amigo Esteban Tundidor",
            "Alla por 2006, en el Paseo La Plaza, como único medio cubriendo el evento de Microsoft durante la semana de la seguridad, lanzando varios productos y novedades. con los amigos del MUG y con genios como Alejandro Ponike y Maria Fernanda Perez Marino (Directora del MSDN Latam). ",
            "Casi 4 años llenos de desafíos, con mucho para hacer por delante y con un único objetivo... ser participes del crecimiento de la empresa, hasta convertirla en un Unicornio.",
            "Quieres aprender a crear tu base de datos GRATUITA en AZURE ?\nhttps://lnkd.in/d6YuEwZS",
            "Los invito a suscribirse a mi canal, ya son 6.87K miembros. comencé a subir material gratuito y subiré mas capítulos de los cursos de forma gratuita.\nhttps://pst.cr/GsY3D.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nSuper Mega Curso de Desarrollo 2023 +50 horas\nTodas las tecnologías que debes conocer para trabajar como Desarrollador: Programación, Linux, Cloud, Seguridad inf. etc\nhttps://pst.cr/wSCve.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende desde 0 VBA - Macros Excel\nAprenderemos todo sobre Macros, VBA, programaremos en Excel, Ejemplos reales y prácticos\nhttps://pst.cr/Lhkam.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nDesarrolla un Video Juego Arcade desde 0 con C++\naprenderás a desarrollar desde 0 en entorno multimedia, con c++, allegro, codeblocks, ttf2pcx y grabber.\nhttps://pst.cr/ND1R6.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta p4 días) \n\nMaestría en AWS RDS: Domina la Gestión de Bases de Datos\nDesbloquea el Poder de AWS RDS - Adquiere gran Expertise en Base de Datos Cloud para Impulsar tu Carrera Profesional\nhttps://pst.cr/LroNA.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nConviértete en un experto en AWS orientado a Datos !\nLambdas, EventBridge, Cloudwatch, RDS Aurora Serverless 2, SecretManager, DynamoDB, SNS, alertas a Discord / Slack.\nhttps://pst.cr/vzjNd.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Prompt Engineering con ingenieros de la UBA desde 0\nPrompt engineer es la profesión más cotizada del momento. aprende Generative AI y obtiene sueldos altos\nhttps://pst.cr/RVf4Q.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nSQL Server - Curso completo - de 0 a Avanzado [2024]\nTSQL - Crear Bases, Tablas, Campos, Indices, Tipos de Usuario, Funciones, Stored Procedures, Triggers, Azure\nhttps://pst.cr/H6Ffu.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Lenguaje GO desde 0 !!\nToda la Sintaxis, estructuras y secretos del lenguaje GOLANG, desarrollamos un backend completo para una APP\nhttps://lnkd.in/eK-hRcar.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nCurso Completo de Bases de datos - de 0 a Avanzado\nBases de Datos, MySQL, teoría y práctica, Lenguaje SQL completo, Base de datos MySQL, Diagrama EER, AWS RDS, Cloud\nhttps://lnkd.in/efeKer8u.",
            "Te invito a un capítulo gratuito de mas de 20 minutos de \nCreamos base de SQL SERVER en AZURE \nhttps://pst.cr/bm3YT.",
            "Consigue este curso NUEVO y DESTACADO por UDEMY a solo $ 9.99\nCurso Completo de SQL SERVER desde 0 [2024]\nhttps://pst.cr/yqAhM.",
            "Te invito a ver este capitulo gratuito. Stored Procedures en SQL SERVER !!\nhttps://pst.cr/mmpnr.",
            "El mejor Hotsale de todos con el mejor equipo",
            "Instalando SQL SERVER, clase gratuita\nhttps://pst.cr/mB3yX.",
            "Nuevo Curso !!!\nSQL SERVER Curso Completo desde cero\nhttps://lnkd.in/eESTt_j2.",
            "CURSO NUEVO !!!! SQL SERVER Curso Completo desde 0 !!\n\nAprovecha este curso desde este link !\nhttps://lnkd.in/etqc5Uay\nA solo $ 9.99 por 4 días !!\nEste curso te sumerge en el mundo de SQL SERVER, desde lo mas elemental y básico, hasta manejos y aspectos super profesionales y avanzados.\nTodos desde cero.\nAprenderás con el siguiente temario.\nIntroducción\nInstalaciones necesarias\nConceptos básicos de Bases de Datos\nDescargarán e instalaran nuestra propia Base de datos\nCrearán tablas y las configurarán\nAprenderán sobre Triggers, Constraints, Espacios de Nombre o Schemas, Campos IDENTITY\nNormalizaciones de Bases de datos, básica y avanzadas\nLas Formas Normales (desde la 1ra hasta la 6ta)\nBuenas Prácticas (TIPS profesionales)\nLenguaje SQL Completo\nLenguaje SQL Propio de SQL SERVER\nEjercicios de Lenguaje SQL (pondremos en práctica lo aprendido)\nInstrucciones de Consola de SQL SERVER\nFunciones Nativas de SQL SERVER\nDatabase Diagrams & Foreign Keys\nVistas en SQL SERVER\nStored Procedures - T-SQL\nCreando Stored Procedures reales\nFunciones en SQL SERVER\nTriggers en SQL SERVER\nManejo de Transacciones\nFull-Text Search completo\nTablas Temporales en SQL SERVER\nBackup & Restore en SQL SERVER\nScheduled JOBS (Tareas Programadas)\nSeguridad - Manejo de Usuarios, Roles y Permisos\nSQL Profiler (inspeccionando las operaciones que corren en el motor)\n\nEste curso es un punto de partida y se le añadirá mas material, temas nuevos, Cloud y muchas cosas más de forma casi constante.\n\nSin dudas el curso mas completo que encontrarás de SQL SERVER.\n\nTe espero dentro del curso !\nTienes 30 días para solicitar reembolso bajo los Términos & Condiciones de Udemy\n\nLos espero !!\n\nPablo Tilotta\n",
            "Se viene. LA BESTIA",
            "🚀✨  Únete a nuestro equipo de #TechLead en Aper y trabaja con los mejores de la industria! ✨ 🚀\n\n¿Te gustaría aprender de dos grandes profesionales de la industria? En Aper, tienes la oportunidad de hacerlo.\n\nFacundo Viale y Eduardo Echeverria son líderes experimentados en el mundo de la tecnología, con una trayectoria impecable que ha marcado la diferencia en empresas líderes del sector.\n\n👉 Facu es un líder tecnológico con más de una década de experiencia en roles de ingeniería de software y gestión. Ha construido productos y equipos de alto rendimiento, influenciando de manera significativa la estrategia de ingeniería y el desarrollo organizacional.\n\nEn su rol actual como VP de Ingeniería en Aper, lidera un equipo de más de 30 ingenieros enfocados en desarrollar una plataforma escalable para bancos e instituciones financieras. Anteriormente, desempeñó el cargo de VP de Ingeniería del vertical en Rappi, donde lideró un equipo de 100 personas en la transición hacia una mentalidad de producto, la implementación de prácticas óptimas y la construcción de un ecosistema de microservicios confiable.\n\n👉 Eduardo es un experimentado ingeniero de software y líder de equipos con un enfoque firme en la calidad y la coherencia en todas las fases del desarrollo de software. Su compromiso con la entrega de software escalable y de alta calidad es evidente en toda su carrera.\n\n Actualmente se desempeña como Head of Engineering en Aper, donde lidera varios equipos de ingenieros y es responsable de la calidad técnica y la entrega oportuna de los proyectos de software. Ha ocupado roles de liderazgo en reconocidas empresas como Rappi, Merlin y Torre Technologies Co, donde se destacó por impulsar la calidad y la coherencia en todas las fases del desarrollo de software, trabajando de cerca con equipos de ingeniería, control de calidad y gestión de productos.\n\nEduardo ha sido un activo miembro de la comunidad de software libre, manteniendo paquetes para el proyecto Fedora Linux durante más de una década y participando como embajador y conferenciante. También ha sido mentor en el programa Google Summer of Code.\n\nEn Aper, tendrás la oportunidad de liderar equipos apasionados por construir una plataforma escalable para bancos e instituciones financieras. ¿Te gustaría ser parte de este equipo de alto rendimiento?\n\nComo Tech Lead en Aper tendrías oportunidad de: \n\n- Aprender de dos expertos de renombre en la industria.\n- Oportunidades de crecimiento profesional y desarrollo de habilidades.\n- Cultura de trabajo colaborativa y enfocada en el éxito mutuo.\n\nSi estás listo para dar el siguiente paso en tu carrera y trabajar con los mejores, ¡queremos conocerte! Envía tu CV a mhernandez@aper.com y únete a nosotros en esta emocionante aventura.\n\n¡Hablemos sobre tu futuro en Aper! ✨\n\nTe dejo por acá todos los detalles 👇😁🎯\n\n#oportunidades #techlead #aper\n",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nSuper Mega Curso de Desarrollo 2023 +50 horas\nTodas las tecnologías que debes conocer para trabajar como Desarrollador: Programación, Linux, Cloud, Seguridad inf. etc\nhttps://pst.cr/ivdoJ.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende desde 0 VBA - Macros Excel\nAprenderemos todo sobre Macros, VBA, programaremos en Excel, Ejemplos reales y prácticos\nhttps://pst.cr/9DtfU.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nDesarrolla un Video Juego Arcade desde 0 con C++\naprenderás a desarrollar desde 0 en entorno multimedia, con c++, allegro, codeblocks, ttf2pcx y grabber.\nhttps://pst.cr/o6LKh.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta p4 días) \n\nMaestría en AWS RDS: Domina la Gestión de Bases de Datos\nDesbloquea el Poder de AWS RDS - Adquiere gran Expertise en Base de Datos Cloud para Impulsar tu Carrera Profesional\nhttps://pst.cr/EWUu5.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nConviértete en un experto en AWS orientado a Datos ! \nLambdas, EventBridge, Cloudwatch, RDS Aurora Serverless 2, SecretManager, DynamoDB, SNS, alertas a Discord / Slack.\nhttps://pst.cr/1JRSM.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Prompt Engineering con ingenieros de la UBA desde 0\nPrompt engineer es la profesión más cotizada del momento. aprende Generative AI y obtiene sueldos altos\nhttps://pst.cr/CSdx2.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Lenguaje GO desde 0 !!\nToda la Sintaxis, estructuras y secretos del lenguaje GOLANG, desarrollamos un backend completo para una APP\nhttps://pst.cr/BcgU2.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nCurso Completo de Bases de datos - de 0 a Avanzado\nBases de Datos, MySQL, teoría y práctica, Lenguaje SQL completo, Base de datos MySQL, Diagrama EER, AWS RDS, Cloud\nhttps://pst.cr/bvG4X.",
            "Maestría en AWS RDS: Domina la Gestión de Bases de Datos\nDesbloquea el Poder de AWS RDS - Adquiere gran Expertise en Base de Datos Cloud para Impulsar tu Carrera Profesional\nCurso con 4.8 de rating en Udemy\n30 días de seguro de Reembolso\nhttps://pst.cr/czWYm.",
            "¡Hola a todos! Estoy buscando empleo y os agradecería el apoyo. Gracias de antemano por cualquier contacto, recomendación u oportunidad. #OpenToWork",
            "¿Quién dice que para innovar se necesita mucho dinero? Acá tenemos un innovador en potencia ¡Es un genio!",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nSuper Mega Curso de Desarrollo 2023 +50 horas\nTodas las tecnologías que debes conocer para trabajar como Desarrollador: Programación, Linux, Cloud, Seguridad inf. etc\nhttps://pst.cr/9cvoD.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende desde 0 VBA - Macros Excel\nAprenderemos todo sobre Macros, VBA, programaremos en Excel, Ejemplos reales y prácticos\nhttps://pst.cr/Mdt6w.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nCrea una Red Social tipo Twitter con ReactJS y Golang\nDesarrolla una App como Twitter usando Golang, React y MongoDB.\nhttps://pst.cr/zBgVd.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nDesarrolla un Video Juego Arcade desde 0 con C++\naprenderás a desarrollar desde 0 en entorno multimedia, con c++, allegro, codeblocks, ttf2pcx y grabber.\nhttps://pst.cr/3f3uJ.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nE-Commerce - Golang + NextJS (AWS Cloud)\nGolang + API Gateway + Lambda + Secret Manager + Cognito + RDS + Cloudwatch + NextJS + Github + Postman + Insomnia\nhttps://pst.cr/pmE38.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta p4 días) \n\nMaestría en AWS RDS: Domina la Gestión de Bases de Datos\nDesbloquea el Poder de AWS RDS - Adquiere gran Expertise en Base de Datos Cloud para Impulsar tu Carrera Profesional\nhttps://pst.cr/jWNHf.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nConviértete en un experto en AWS orientado a Datos ! \nLambdas, EventBridge, Cloudwatch, RDS Aurora Serverless 2, SecretManager, DynamoDB, SNS, alertas a Discord / Slack.\nhttps://pst.cr/2pyrj.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Prompt Engineering con ingenieros de la UBA desde 0\nPrompt engineer es la profesión más cotizada del momento. aprende Generative AI y obtiene sueldos altos\nhttps://pst.cr/RFWFE.",
            "Estimado Alumno, te invito a capacitarte por el precio mas bajo (oferta por 4 días) \n\nAprende Lenguaje GO desde 0 !!\nToda la Sintaxis, estructuras y secretos del lenguaje GOLANG, desarrollamos un backend completo para una APP\nhttps://pst.cr/d31Ek."
        ]
    },
    {
        "username": "ACoAAD4G4qIBc_rYFekIAVLz1Cwmg3S17FZTg18",
        "author": "Viraj Kulkarni",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205611891044347904?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205611891044347904%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            3,
            69,
            35,
            46,
            55,
            36,
            53,
            5,
            7,
            47,
            32,
            22,
            12,
            7
        ],
        "description": [
            "I experimented with Golang goroutines and concurrency features by building a load balancer using Go and a round-robin algorithm. The client requests a URL from the load balancer via the terminal, and the request is routed to an available server to serve the requested URL. In response, the URL is opened in the client's default browser, supporting both Linux and Windows. The load balancer manages three servers to handle client requests.\n\nlearnt and implemented concurrency control and goroutines in Go using semaphores and by creating Go channels for server and client URL responses.\n\nGithub - https://lnkd.in/gFR8PSDN",
            "\nWe had a great experience developing the Insignia24 web application for our college, SDM College of Engg & Tech , Dharwad. We managed around 3000-4000 registrations without encountering any bugs or clashes within the web application. We all gained valuable exposure and experience while working in a team, and we had fun throughout the process. Ultimately, we successfully delivered the web app on time.\n\nAkash Desai\nAbhisheksingh Fulanekar\nRahul V.B\nVAISHNAVI HEGDE\nANKITA KULKARNI\nBhoomika Patil\nSumedha Bhat\nRamya Hunagund\n\nCheck out here - sdmcetinsigniafest.com ",
            "Introducing `create-react-tailwindcss` – an NPM project designed to simplify the initiation of React projects with Tailwind CSS. With a single command, it streamlines the configuration process, allowing developers to focus on their code logic rather than grappling with dependency setups.\n\nAs a React-Tailwind CSS learner, I recognized the repetitive nature of the initial setup, prompting me to create this open-source solution. Now, both beginners and developers can easily set up the initial project to get started with the development process.\n\n`npx create-react-tailwindcss <project-name>`. \n\nVisit my GitHub for more understanding about my project\nhttps://lnkd.in/gwMQB4Fv \n\n\n#React #TailwindCSS #OpenSource #DevelopmentEfficiency",
            "Our team, consisting of DILER KHAN .R. BIRADAR , Abhishek Deshpande and myself, developed a RESTful API using FastAPI in Python \n\nThis API serves as a convenient source for general knowledge-related questions, readily accessible and integrable into quiz applications. Utilizing an Excel file as our data source, we harnessed the power of Pandas for seamless data manipulation. Handling GET and POST requests, we employed UVICORN for local asynchronous server management. \n\nOur API delivers JSON-formatted responses and incorporates HTTPException handling for any erroneous requests. This project stands as an entry point to Python, leveraging the fundamental knowledge gained from the Python fundamentals workshop conducted at my college, guided by the insightful teachings of Akshay Kumar U \n\nThe below video demonstrates the api working in Uvicorn local server as\n\n endpoints\n/questions - for all questions\n/questions/numsofquestions?limit=(no_of_questions)",
            "Teaching JavaScript basics and functional programming as a part of the Qwerty.io Club workshop in SDMCET, Dharwad was fantastic! We focused on a fun project a rock-paper-scissors game to help students learn. \nOur team successfully ran the workshop for two days, making sure everyone understood. It was a great learning experience, and we want to improve by adding more real-life projects. Our goal is to keep making learning JavaScript enjoyable and practical for students. We're excited about the impact we've made and eager to keep making learning fun!\n\nOur team\nAkash Desai \nRahul V.B \nSumedha Bhat \nRamya Hunagund \naditya gupta \nBhoomika Patil \nANKITA KULKARNI \nVAISHNAVI HEGDE \nVaishnavi Kulkarni \nVaishnavi Peshwe \nAbhisheksingh Fulanekar \nANANYA R UPADHYA \n\nSpecial thanks to our seniors \nMohammad Raza \nSushrut K N \nPrasanna Kumar \nPavanKumar Shirol \nsoumya katageri \nJai Irkal \nApeksha Konnur",
            "Just wrapped up my first React.js and Tailwind CSS single webpage - a sleek, responsive webpage! 💻\n\n🌐 Crafted with a focus on responsiveness, this single-page frontend marks my initial steps in React.js and Tailwind CSS. Exciting to see how these tools enhance user experiences seamlessly across devices.\n\nCheck it out ->\nhttps://lnkd.in/gPScpb-2\n\n#ReactJS #TailwindCSS #webdevelopment  #responsivedesign  #Frontend",
            "Had a fantastic time teaching UI/UX at the FIGMAVERSE workshop organized by QWERTY.I/O CLUB (our team) at SDMCET, Dharwad. \nWe delved into user-friendly design principles and guided students through crafting prototypes using Figma, adhering to proper IOS design guidelines. Excited to see their skills grow and innovations flourish! \n\nOur team\nAkash Desai \nRahul V.B \nSumedha Bhat \nRamya Hunagund \naditya gupta \nBhoomika Patil \nANKITA KULKARNI \nVAISHNAVI HEGDE \nVaishnavi Kulkarni \nVaishnavi Peshwe \nAbhisheksingh Fulanekar \nANANYA R UPADHYA \n\nSpecial thanks to our seniors \nMohammad Raza \nSushrut K N \nPrasanna Kumar \nPavanKumar Shirol \nsoumya katageri \nJai Irkal \nApeksha Konnur ",
            "Few months ago, I had created a user interface for a food delivery application named - Foody 🍕 \nToday I am sharing my complete case study for the same application and this stands to be my first case study to be presented on my Behance profile. The UI/UX case study are crucial as they offer a window into the design process.\n\nCase study overview 📌\nThe case study mainly covers the user interface design thinking which delivers the process of creating a user interface design and documenting the process with collective elements used.📝\n\nFollow the link to explore my case study\n\nhttps://lnkd.in/gJUGM8S3\n\n#UIUXDesign #DesignSystem #Figma #UserExperience #FoodDeliveryApp #CreativeDesign",
            "hello everyone, I would like to share my experience in designing the UI/UX for a food delivery app called Foody using Figma. During the design process, I gained valuable insights into the design principles of delivery-related apps and learned how to create various screens, including login, signup, main screen, profile, payment, and billing screen. This project helped me to enhance my design skills and provided me with hands-on experience in creating user-friendly interfaces for mobile applications.\n",
            "It was great attending React-n-Roll 2.0 meetup with Viraj Kulkarni  yesterday at Rakuten India, Bangalore!\n\nWe had Apurv Khare from Adobe talk about building adaptive, accessible & internationalised React apps using React Aria from Adobe Spectrum. Learnt about building balanced and flexible design systems from Kamlesh Chandnani, Razorpay & leveraging mock APIs during development from Vishwesh Jainkuniya, eka.care\n\nIt was worthy to be able to collect the insights & connect the dots from the session and realise their applications. What a fortune to know them early! Leveraging mock APIs is going to be fun.\n\nI also had the opportunity to meet & chat with Kamlesh Chandnani, Principal Frontend Engineer, Razorpay, Apurv Khare, SDE 3, Adobe and Yashraj Nayak, DevRel Professional.\n\n#react #adobespectrum #aria #apis #designsystem #frontend ",
            "Recently had the privilege of attending the React n Roll event at Rakuten in Bangalore with my close friend Karan Kakati. The event focused on key aspects of React.js, including building components with accessibility in mind and exploring mock APIs. I gained valuable insights into the world of React and its significance in the JavaScript market. It was truly inspiring to connect with industry experts like Apurv Khare  from Adobe and Yashraj Nayak from OutSystems. Grateful for the learning and networking opportunities at this enriching event! #reactdeveloper #ReactNRoll #learningcommunity ",
            "Hello everyone, \n\nWe hosted a captivating event at SDMCET under the banner of the QWERTY Club, specifically designed to assist seniors embarking on their career journeys. The event provided a platform for distinguished professionals to share their valuable experiences from the industry. They offered insights into the roadmap for skill acquisition and enlightened attendees about the intricacies of the placement process.\n\nI would like to thank our seniors for providing us with this opportunity \n\nMohammad Raza \nApeksha Konnur \nJai Irkal \nPavanKumar Shirol \nsoumya katageri \nSushrut K N \nPrasanna Kumar \n\nAnd I would like to mention our team\nVAISHNAVI HEGDE \nAditya Gupta\nRamya Hunagund \nSumedha Bhat \nSai dinesh\nRahul V.B \nSlash\nVaishnavi Peshwe \nVaishnavi Kulkarni \nAbhisheksingh Fulanekar \n\n\n #career #event #like ",
            "Attended a masterclass on the high-level design of OTT apps! 📺 I gained valuable insights into creating captivating, designing systems and user-friendly Over-The-Top experiences. The session covered fundamental OTT concepts, design principles, content personalization, cross-platform compatibility, and emerging trends. I learned how to design intuitive interfaces, leverage personalization techniques, and optimize performance across devices. This masterclass has equipped me with practical knowledge to excel in the competitive landscape of OTT apps.\n",
            "hello everyone, I would like to share my experience in designing the UI/UX for a food delivery app called Foody using Figma. During the design process, I gained valuable insights into the design principles of delivery-related apps and learned how to create various screens, including login, signup, main screen, profile, payment, and billing screen. This project helped me to enhance my design skills and provided me with hands-on experience in creating user-friendly interfaces for mobile applications.\n"
        ]
    },
    {
        "username": "ACoAACm1bqQBkmUH4mzFsixj0zTVY4utMywHTSE",
        "author": "Víctor Raton",
        "source": "linkedin",
        "source_link": "https://www.linkedin.com/feed/update/urn:li:activity:7205589833455484928?updateEntityUrn=urn%3Ali%3Afs_updateV2%3A%28urn%3Ali%3Aactivity%3A7205589833455484928%2CFEED_DETAIL%2CEMPTY%2CDEFAULT%2Cfalse%29",
        "mention": "golang",
        "mentions_texts": "golang",
        "hashtags_texts": "golang",
        "like": [
            8,
            10,
            63,
            9,
            14,
            44,
            12,
            14,
            23,
            29,
            1,
            31,
            6,
            13,
            12,
            3,
            4,
            9,
            1,
            11,
            13,
            13,
            158,
            2,
            5,
            5,
            0,
            164,
            2,
            12,
            1,
            15,
            8,
            7,
            7,
            7,
            4,
            4,
            3,
            273,
            4,
            15,
            12,
            27,
            8,
            8,
            32,
            1,
            34,
            1
        ],
        "description": [
            "\"Coloca isso num json ou em .env\"\n- Dev junior que nunca passou pela dor de armazenar configuração de usuário em app\n\n#Domingou aqui e eu quis trazer esse conteúdo pra quem tem interesse em fazer app ou utilitário de desktop usando arquivos de configuração de usuário.\n\nCada sistema operacional possui uma estrutura recomendada para armazenar informações no seu app.\n\nO legal de #Golang é que o módulo os já facilita sua vida fornecendo um shortcut para o path desse diretório de acordo com o sistema.\n\nE como todo código #Golang é superficial de entender e reimplementar isso em outras plataformas, legal né?\n\nÉ só isso por hoje, bom final de final de semana e nos vemos por aqui...",
            "E vamos de novo desafio , como falei mais cedo , hoje foi meu primeiro dia na Global Hitss\n\nE vamos lá...\n\n#soutech\n#souhitss\n#sougptw",
            "#Segundou como?\n\nGostaria de compartilhar que estou começando em um novo cargo de Analista de sistema na GLOBAL HITSS \n\nHoje é meu primeiro dia, nesse novo desafio!",
            "Eu to vendo muita gente comemorar isso aqui....\n\nComo pessoa que venceu a Gupy duas vezes vou deixar o meu relato....\n\nA plataforma nâo é boa nem ruim, é irrelevante na real, não vejo muita diferenca em relação as demais opções no mercado, talvez seja um pouco melhor por ser mais customizavél os processos seletivos?\n\nA reclamaçâo de todos:\n\n- Processos muito longos\n- Vagas fantasma\n- Falta de retorno\n- Exclusão sumária por AST e afins.\n\nSão coisas que não tem haver com a plataforma, não importa pra onde migrem, se o proceaso seletivo é uma droga, sair da plataforma é fazer valher o ditado. Mesmo lixo , caçamba diferente.\n\nSobre uso de AST e IA, me desvulpe te decepcionar jovem Padawan, mas os processoa seletivos são excludentes de propósito. A culpa não é da IA , é do status quo do mercado no geral, ta dificil pra iniciante poia o momento é de platô, vivemos uma bolha desde 2010, por sorte a pandemia controlou o estouro dela.\n\nEntâo se o proceaso está difícil, tá ruim se recolocar, não é a plataforma X ou Y que está fazendo isso, sâo os contratantes, afinal o que seria do mercado de trabalho sem o desemprego....",
            "\"Em golang você fica usando toda hora if err != nil....\"\n- Dev junior que acha que try catch resolve algum problema\n\n\n\nEsses últimos dias estava brincando e experimentando formas novas de fazer o vagabot (nome ainda sendo trabalhado), e percebi que a versão que fiz em #python me obriga a tratar mais erros se comparada a mesma funcionalidade em #elixir e #golang, o motivo disso é a diferença de tratamento de erros nesses ambientes.\n\nEm #python temos o conceito de try Exception , onde podemos criar fluxos de execução conforme tipos de erro, assim somos influenciados a criar classes de erro para situações específicas de erros em nossas bibliotecas e tratar esses erros conforme esses tipos, esse formato não é tão determinístico, pois você tem que supor e \"adivinhar\" quais erros cada parte de seu código pode causar.\n\nEm #golang temos o outro extremo, onde erros são obrigatoriamente tratados como valores, ou iremos causar um panic em nossas aplicações (if crash, let crash), o interessante disso é que ao consumir bibliotecas não  precisamos \"adivinhar\" quando um erro irá ocorrer, o mesmo é retornado por uma função no padrão (*Result, error), assim para fazer o caminho feliz , não precisamos saber qual erro ocorreu, apenas validar o que fazer se houve erro ou sucesso. Como erros são tratados como valores, os desenvolvedores podem ignorar, mas na maioria dos casos não vão se deparar com erros \"surpresas\" ou o famoso \"põe tudo no try/catch\"\n\nJá #Elixir possui ambas as possibilidades, podendo lançar exceções e fazer tratamentos com try/do, tanto quanto usar pattern match para em caso de erro retornar uma tupla com {:eror, reason}, mas existe uma convenção para coisas que sejam funções que lancem essas exceções anônimas, se usa um ! no final do nome da função, assim assume-se que em caso de erro essa função não teria retorno, apenas explodiria uma exceção,\n\nEu particularmente consigo desenvolver nos 3 modos, mas como dev preguiçoso , sou mais inclinado a usar o modelo do #golang\n\nColoquei aqui em baixo trechos de código da implementação de login do vagabot usando #Elixir, #Golang e #Python para verem a diferença.\n\nLembrando que a implementação em python eu separei em duas classes e tem uma feature a mais, mas mesmo assim o volume de código escrito e tratamento de erro é maior\n\nMas e você , o que acha? Deixe sua pill sobre error handing nos comentários\n\n#Python\n#Elixir\n#Golang\n#CodeInFriday",
            "Fala seus casca de bala\n\nPassando aqui apenas pra dizer que por causa do home office hoje oficialmente fazem 4 anos que não uso calça ou sapatos em horário comercial.\n\nO post é só isso mesmo, bom feriado\n\n#HomeOffice4life\n#Remoto",
            "\"Meu navegador mantém minhas coisas logadas para não ficar logando toda hora\"\n- Dev junior que corre risco de sofrer ataques como session hijack\n\nIsso mesmo que você leu, não é #FakeNews ou Venda de curso, sou eu mesmo cagando regra para como você deve usar seu navegador.\n\nEsse software que temos em todos os dispositivos, fazem mais do que deviam, repare que é um programa que tem:\n- Acesso á FileSystem;\n- Acesso á rede;\n- Acesso á GPU\n- Acesso a devices como câmera e microfone\n\nSe eu fosse uma pessoa mal intencionada a primeira ferramenta que eu tentaria obter acesso seria o navegador.\n\nEntão aqui vai algumas dicas de como ficar menos vulnerável ao usar essa caixa de pandora. \n\nSeu navegador deve estar em \"sandbox\", ele não deve lembrar de nada, não deve fazer nada automaticamente, exceto quando você explicitamente libere. \n\nPor isso que ao fechar o seu navegador deve:\n- Apagar o seu histórico de acessos e downlaods\n- Apagar TODOS os cookies e informações em localstorage\n- Retornar todas as permissões de acesso a hardware para o padrão de perguntar antes de usar\n\nAh e nada de usar gestão de senhas e armazenar cartão de crédito nos seus navegadores, não necessariamente por segurança mas por conveniência, esse tipo de coisa deve estar em ferramentas externas como #Bitwarden e #ProtonPass para que possa ser usada independente de navegador ou plataforma de sistema operacional.\n\nDos navegadores que eu já usei , #Firefox, #LibreWolf e #Brave são os que tornam essa tarefa de navegador sandbox mais simples de se configurar.\n\nE assim meus amigos, vocês diminuem o que chamamos de \"surpeficie de contato\"\n\nDepois diga que não avisei\n\nhttps://lnkd.in/dQCVU3KN\n\n#Privacy\n#Browser\n#FirefoxIsKing",
            "Parabéns aos envolvidos da Grupo OLX o site de vocês é pessimo.\n\n\nUm susposto cadastro de um usuário na plataforma de vocês usando meu número pessoal de telefone não pode ser denunciado SE eu não tiver uma conta?\n\nEm que universo isso faz sentido?\n\n\nEdit: Consegui logar, mas ao fazer a denuncia não tive retorno, protocolo de atendimento nem nada...",
            "Pode parecer simples, mas inversão de depedências e composição tornam seu código mais fácil de extender e testar\n\nNo exemplo abaixo eu tenho uma implementação de uma classe que extrai dados de um pdf o qual é baixado de um link. Essa primeira versão está fazendo \"Coisa demais\" em um só local, dai decidi refatorar em um componente menor apenas para download e outro para extrair os dados que dependemda de uma interface genérica, isso se chama #Composição\n\nEu quebro minhas funcionalidades em pequenos componentes e defino interfaces e contratos para estes componentes , mesmo em uma linguagem tipiada dinamicamente como o #python, isso irá salvar muito tempo em debug, pois usando a extensão #mypy consigo validar esses tipos\n\nE sim eu poderia definir isso por meio de funções simples tanbém, mas esse código se for ver não está muito diferente do que eu faria com os módulos do #Elixir que estudei recentemente.\n\nAgora diz ai como vocês fariam esse código ficar melhor?\n\n#Python\n#Refactoring\n#Code\n#Composition",
            "\"Dois monitores é tudo que um dev precisa\"\n\n- Dev junior que acha legal ter uma porrada de tela pra escrever hello word em python\n\n\n#Sabadou e vim falar aqui de uma dica de ouro que me deram a uns anos atrás, eu não tenho contato com a pessoa mais e n sei se ela tem linkedin...\n\nMas um dos colegas do grupo de golang me disse em 2021 pra comprar um monitor ultrawide barato da LG.\n\nPois bem, comprei um monitor de 23 pol ultrawide em 2022 e não voltei atrás, uso somemte uma tela , mas consigo ser eficaz , pois configurei meu querido #Gnome com shotcuts fáceis de se gerir pelo teclado para gerenciar telas, imitando parte do comportamento do #i3wm\n\nUm monitor ultrawide substitui dois monitores normais e aqui está a conta:\n\nUm monitor convencional possui um aspect ratio de 16:9, em hd é a resolução de 1980x720p, um monitor ultrawide possui um aspect ratio de 21:9 (fazendo conta de padeiro 25% a mais) com 3440x 1440 em 2k ou 2560x1080p em modelos hd.\n\nEm suma dá pra abrir sua página web com 1920p ao lado do seu editor com 640p que considerando que vc use 80 colunas de quebra de linha se encaixa perfeitamente....\n\nEntão compre um monitor ultrawide, deixe de palhaçada e aprenda a usar o seu teclado pra gerir suas janelas, combando isso com um teclado ergonômico barato e um mouse vertical, você consegue codar por 8h sem grandes problemas de ergonomia, plus é que não tem que lhedar com o inferno de gerir espaço e cabo pra 2 monitores\n\nDepois diga q n avisei....\n\n#Ultrawide\n#SingleMonitor\n#Gnome",
            "Navegando pelos confins do #mastodon pra lhedar com o tédio achei esse projeto aqui que busca trazer suporte para desenvolvedores pythom negros (me desculpem se usei o termo errado , favor me corrijam)\n\nVi bastamte coisa e parece que agora estão sob o guarda-chuva da #Gnome Foundation.\n\n#OSS e tech é inclusão tanbém...\n\n#PythonCommunity\n#PythonBlackDevs",
            "\"Simplicity is complicated subject\"\n- Robert Pike\nEntão vamos simplificar o difícil e generalizar o que dá. Segue o post...\n\n\nRafael Fischer, MSc compartilhou recentemente um post sobre um código jaavscript onde haviam várias pequenas funções para extrair o primeiro e o ultimo nome do usuário.\n\nhttps://lnkd.in/dYBedRhM\n\nRefletindo aqui nos meus últimos dias de estudo sobre golang e elixir eu decidi reimplementar essa funcionalidade com aquilo que aprendi com as duas langs que vai refletir em código JS e Python que eu fizer daqui pra frente \n\nCom go eu aprendi que simplicidade se paga, melhor uma cópia simples do que uma dependência simples, isso vale para módulos, uma função não pode depender tanto de uma estrutura bem definida, no post é delimitado que usuário é um objeto com as propriedades firsdtName e lastName, mas pessoas como eu term vários sobrenomes, no final do dia o nome é uma string então pouco me importa a estrutura de seu app se seu objetivo é gerar o texto do nome, faça uma função que capitalize todas as palavras de uma string\n\nO que eu aprendi com elixir é: em face a mutabilidade processe os dados em vez de mudá-los, simplesmente usando map de array como se fossem pipes, assim mudando os dados para o formato que eu quero, usando entradas genéricas\n\nPor fim deixei um truqezim pra gerar uma string única a partir da estrutura de dados apresentada e de quaisquer outra, apenas definindo os campos, mas pode simplesmente gerar uma string template com o que precisar\n\nO resultado é este na imagem abaixo.\n\nO que acharam?\n\n#Javascript\n#Simplicity\n#Elixir\n#Golang",
            "Cara surpreso por em tese com base nos dados apresentados termos média laboral maior que o japão (sim trabalhamos mais que os japonese)\n\nCurioso tanbém a questão sindical consoderar só a efetivação factual, pois eu nunca me associei de fato a algum sindicato mas lembro de alguns momentos ter uma parte do meu salário comprometida...\n\nNa época não me importava tanto e não parei pra investigar....",
            "#Sextou e nois tá como?\n\n\nInventando arte em elixir, vou tentar fazer esse tal de Hound (https://lnkd.in/dc_knukB) refazer o vagabot , mas dessa vez sendo gerido como process erlang\n\nMeu objetivo final é usar o phoenix como \"orquestrador\" e usar os proccess do erlang/otp pra cada um deles ser um \"bot\" , por hora vou chamar essa idéia de Botox\n\n#Elixir\n#Webscrapping\n#Selenium\n#Hound\n#WeekendToy",
            "\"O Melhor Teste é Aquele Feito em Produção\"\n- Dev sem noção que vai ficar trabalhando até tarde para corrigir um if. 🤦‍♂️\n\n\n\nAmigos, testes são um negócio complicado. Já passei por situações em que reclamaram que eu escrevo “testes demais” e outras em que disseram que escrevi “testes de menos”. Mas não basta apenas escrever testes; seguir #TDD (Desenvolvimento Orientado a Testes) não garante nada se os testes não tiverem propósito. Afinal, ter 80% de cobertura de testes não garante que os 20% não cobertos não possam causar uma falha grave e irreversível em produção.\n\nPara testar com propósito, é necessário entender também como funcionam suas ferramentas. No mundo #Python, a biblioteca mais usada é o #pytest. Essa maravilhosa biblioteca possui inúmeras features e integrações, sendo a principal delas a definição de fixtures.\n\nFixtures são estados compartilhados entre testes, algo um tanto estranho de se ouvir quando se fala em testes e #Python na mesma frase. 😄\n\nEscrevi um post mostrando um pouquinho de como usar essas fixtures a nosso favor. Se você quer aprofundar seus conhecimentos sobre o pytest, confira o guia prático que preparei:\nhttps://lnkd.in/dH88RC-N\n\nLembre-se: testes bem escritos e com propósito são essenciais para garantir a qualidade do seu código em produção. Vamos testar com sabedoria! 🚀\nEspero que goste!\n\nE não, funcionar em produção não é o melhor teste , é só uma forma de ter dor de cabeça e retrabalho.\n\n#Python #Pytest #Fixtures #TDD",
            "Muito bom kkkkkkkkkkkkkkk",
            "divertido e interativo, gostei",
            "Fale bem, fale mal, mas fale de #dataclass 🐍\n\nIntroduzidas na versão 3.7 do Python na PEP 557 (https://lnkd.in/dbsY64xE), as #dataclass nos permitem criar estruturas de dados \"flat\" sem precisar de todo aquele código boilerplate para reproduzir o comportamento semelhante a structs de C em classes.\n\nUma das features que eu mais gosto é a capacidade de criar dados imutáveis com campos bem definidos e valores padrão. \n\nAlém disso, as dataclass possuem variáveis especiais em seus construtores que permitem adicionar automaticamente alias para suporte a ordenação e comparação, facilitando o uso em condicionais.\n\nVantagens das #dataclass:\n\n- Menos Código Boilerplate: Não é mais necessário escrever manualmente métodos comuns como __init__ e __repr__.\n\n- Legibilidade: O código é mais limpo e fácil de ler, focando no que realmente importa - os dados.\n\n- Imutabilidade: Com a opção frozen=True, você pode criar objetos imutáveis, semelhantes a tuplas.\n\n- Comparação Fácil: As #dataclass automaticamente implementam métodos de comparação, como __eq__.\n\n- Herdabilidade: As #dataclass suportam herança, permitindo criar hierarquias de classes (use com moderação).\n\n- Métodos Customizados: Você ainda pode adicionar métodos personalizados dentro de uma #dataclass.\n\n- Campos com Valores Padrão: Utilize field(default=valor) para definir valores padrão.\n\nCenários Ideais para Uso de #dataclass:\n\n- Modelagem de Dados Rápida e Independente: Permite definir dados de forma simples em uma estrutura flat sem se comprometer com bibliotecas externas como ORM's.\n\n- Configurações e Parâmetros: Para armazenar configurações ou parâmetros de forma estruturada.\n\n- Retornos de API: Estruturar a resposta de uma API torna-se mais fácil e organizado.\n\nAlém disso, podemos usar #dataclass em conjunto com ferramentas como #mypy para detecção de inferência de tipo em código fonte, permitindo validar erros de tipagem em processos de CI/CD e evitando subir código falho em produção.\n\nExperimente integrar as dataclass em seus projetos Python e veja a diferença! 🚀\n\nCompartilhe sua experiência com #dataclass nos comentários! #Python #Desenvolvimento #BoilerplateFree #CleanCode\n\nTexto idealizado e redigido por min, Mas corrigido pelo ChatGPT 3.5",
            "Congratulations, AI! Now David can afford to live in captivity or something worse than a prison cell.”\n\n#WorseLife #AI #Bulshit",
            "\"Prefiro não usar o #Debian stable devido às suas aplicações 'desatualizadas'.\"\n- Usuário de linux que nunca leu a wiki e não sabe o que está perdendo.\n\nAntes de tudo, é importante esclarecer que o #Debian GNU/Linux, em sua versão estável, tende a manter pacotes com versões mais antigas para garantir uma estabilidade robusta. No entanto, isso não significa que você esteja preso a essas versões. Uma solução inteligente para esse dilema são os #backports.\n\nOs #backports permitem que você atualize pacotes específicos sem comprometer a estabilidade geral do sistema. Não apenas no #Debian, mas em outras distribuições Linux, essa prática é comum e extremamente útil.\n\nBasicamente, os #backports trazem atualizações de pacotes do #Debian testing e #Debian unstable para a versão estável, oferecendo pequenas correções ou atualizações de segurança. Isso garante que você possa desfrutar das últimas funcionalidades sem sacrificar a estabilidade.\n\nMas como fazer isso na prática?\n\nPrimeiro, é necessário adicionar os repositórios de #backport à sua configuração de atualização. Isso pode ser feito facilmente através da ferramenta gráfica de atualização ou editando diretamente o arquivo sources.list em /etc/apt/sources.list. Lembre-se de incluir as flags necessárias para garantir o acesso a todos os tipos de pacotes, incluindo aqueles que podem estar sob licenças não livres.\n\nUma vez configurado, você pode instalar os pacotes desejados utilizando o comando apt install, acrescentando a flag -t <nome_do_repositório> para especificar de qual repositório você deseja instalar. Por exemplo, se quiser instalar o Cockpit em seu sistema a partir do repositório #backport, basta digitar apt -t bookworm-backports install cockpit.\n\nPara mais informações detalhadas sobre como utilizar os #backports, recomendo consultar a Wiki do #Debian:\n\nhttps://lnkd.in/dYzahf83\n\nDessa forma, você pode desfrutar do melhor dos dois mundos: a estabilidade do Debian stable com as atualizações mais recentes dos seus aplicativos favoritos. Experimente e descubra todo o potencial que o Debian tem a oferecer! 🐧✨ #Debian #Linux #Backports #EstabilidadeEVersatilidade\n\n- Texto criado por min e revisado pelo ChatGPT 3.5",
            "#sabadou e nois tá como?\n\n\n\nRevisando concorrência em #golang.....\n\nTó com umas idéias de girico aqui pra fazer uma coisa diferente no vagabot e distribuir ele em binário , afinal nem todo mundo consegue usar um cli em #python com #docker\n\n#golang\n#neovim\n#concurrency",
            "Network é tudo e mais um pouco.\n\nQuando passei pelo layoff em 2022 Edcleidson De Souza Cardoso Júnior como muitos outros me ajudaram aqui...\n\ncadé os recruiters de plantão\n\n#python\n#datascience\n#opentowork\n#6anosdexp",
            "\"Não uso #linux pois é difícil de instalar\"\n- Dev junior que não sabe o que tá perdendo\n\n\nAgora que já irritei metade do #linkedisney, vou deixar uma recomendação aqui das 3 distros #linux que estão sempre nos meus pendrives de recuperação.\n\nO Bom, o Velho, o Estável, #Debian (Debain GNU/Linux) https://www.debian.org/:\n\nMinha distro atual em máquina pessoal e nas tranqueiras que faço no docker, o nosso bom velhinho não dá presente, mas você não tem surpresas, estável por natureza, eficaz quando necessário, não é tão simples de instalar, pois tem que ler uma porrada de wiki pra achar a ISO, uso por costume com os comandos e configurações padrão, acompanho desde o Debian 9, atualmente no 12, usa o famigerado APT como gerenciador de pacotes, distro sem opinião e sem features\n\nNovo , Confiável e Enterprise,  #Fedora https://fedoraproject.org/\nO Nosso amigo da RedHat esteve comigo entre sua versão 36 e 39, hoje está no 40, aplicações atualizadas, fácil de achar a iso, mas o instalador tem uma UX bizarra, ainda sim você encontra tudo nele, e o mais recente possível (quer vc queira o não), grande amigo dos dev python por ter alguns ajustes finos que permite vc ter várias versões do python instalada sem dar (muito) conflito por causa de umas features no DNF, seu gerenciador de pacote (Um APT com comandos diferentes), é a distro que eu instalaria no PC da minha tia por exemplo.\n\nConfortável, Prático e verde(?) o #Linuxmint https://www.linuxmint.com/\n\nO mint é um projeto que tem como fundamento decisões embasadas no uso, é a distro que quando você migra do windows, te faz esquecer por breves momentos que trocou de sistema. Basicamente carrega todas as boas decisões do Debian e do Ubuntu, mas sem as confusões da Canonical (Malditos Snaps) e dificuldades de instalação do Debian, Distro pra instalar no PC da sua família, usa o APT como base, mas com repositórios próprios, o mint tem como carro chefe sua interface gráfica, Cinnamon com opções pra seu PC da hello kitty que tá juntando poeira. Usei por pouco tempo , troquei por ser um Debian \"simplificado\" que não atendia ao meu rigor á software padrão, mas isso é só eu sendo o chato\n\nA melhor parte do penguin: De Grátis, mas se quiser atualizar você paga R$ 0,00 e por incríveis R$ 0,00 remove os anúncios do menu iniciar. Promoção imperdível até o dia que conseguirem dar nó em pingo d'água \n\nEdit1: Nem sempre dá pra se livrar do janelas, mas podemos usar esse brinquedo mágico chamado WSL, que entre muitos o Henrique Mathias Jardim deixou at;e o link aqui de como configurar https://lnkd.in/dG4udKj5 , dessa nem eu sabia, instalei WSL por instinto kkkk",
            "Primeiramente lamentavél tamanha incompetência em pleno século 2024....\n\nNão é comparando dores mas tenho bastante problema com reconhecimento facial por ser pessoa albina...\n\nEm certas ocasiões como desenvolvedor já perguntei a certas empresas em processos seletivos pra atuar em produtos sobre como é feito a oferta de acessibilidade, pois é algo que sempre tenho interesse em contribuir....\n\nAlgumas vezes tinham a cara de pal de responder que \"isso\" não é prioridade.\n\nOutras vezes sequer sabiam sobre algo....\n\nPessoal de tecnologia e produto  tem muito que aprender...",
            "Bora pessoal dar um UP",
            "Dê uma folga a si mesmo usando #python e curta o #StarWarsDay....\n\n\nNão, isto não é um post motivacional ou sobre carreira, apenas passando aqui pra mostrar um showcase de uma biblioteca que tenho usado ultimamente e nunca tinha visto algo assim em outro ecossistema, estou falando da biblioteca holidays (https://lnkd.in/dxQkZ3bN) em python, que nos permite gerar calendários de feriados compatível com  o objeto `datetime.date` nativo do python\n\nEntão toda vez que precisar gerenciar calendários e funcionalidades com base em feriados em seus projetos , dá uma olhada depois, e pra não perder o timing do #StarWarsDay,  aqui vai um códigozinho em python  que vai te ajudar a justificar que sim, para os nerds , hoje é feriado\n\nUm pocu mais sobre o \"feriado\" em questão: https://lnkd.in/duRirCFR",
            "Cad6e os #nerds de pantão?",
            "Desinstalei o #VSCode e essa foi a melhor decisão da minha vida.....\n\n\nCalma lá jovem padawan, o #VSCode ou #VSCodiun não é um programa ruim, usei ele nos ultimos 4 anos profissionalmente e sem dores de cabeça, porém sempre me incomodou uma ferramenta 'Open Source\" não ser fácil de entender, fora que me sentia limitado a uma gama de plugins, até cheguei a escrever alguns alias e snippets enquanto trabalhei como dev React na Ecglobal Business em 2019, mas nunca estive 100% satisfeito com as possibilidades de configuração\n\nSeguindo a jornada de muitos companheiros no #linux, comecei a usar o #Neovim, isso desde o ano passado, mas desde o dia 06 de março venho usando ele em produção, no meu dia-a-dia , inclusive coisas relativamente avançadas como debug .\n\nE sim, quando você passa a controlar os seus shotcuts, fazer refinamentos e customizações de suas extensões  você ganha mais do que perde, no início o VSCode parecia fazer sentido com o falso pragmatismo de \"I Just Code man\", mas quando se mergulha de cabeça nas ferramentas que você usa, passa a opinar mais sobre elas...\n\nUm exemplo disso é o fato de que eu me livrei do prettier como plugin pra identação dos arquivos do meu projeto cep-any.\n\nConsigo utilizar mais ferramentas de git como os logs e o blame pra entendr melhores formas de resolver conflitos, consigo navegar de forma rápida e focada em projetos extremamente grandes como o Querido Diário, o qual de vez em quando tento contribuir.\n\nSe você já está na área a um tempo , está \"confortavél\" com o #VSCode ou seu toolkit da #JetBrains, recomendo que ao menos pesquise e tente utilizar extensões para que possa navegar usando vim motions, muito útil.\n\nAh e grande detalhe para os céticos, eu uso a MESMA configuração no Debian (Atualmente Bookworm) e no #WSL, e usando um pouco da magia do git consigo manter a mesma IDE nos dois sistemas sem grandes dores de cabeça...\n\nEdit: O título do post é um clickbait, eu não desinstalei o #VSCode , ainda mantenho ele em ambos os ambientes , mas faz meses que não uso....\n\nEdit2: Como tô vendo  muita gente me recomendar distribuição do neovim eu decidi falar que já testei a maioria e não gostei de nenhuma, fazer do zero e do meu jeito me ensinou muito, desde o básico de lua a conceitos como as API`s do vim e coisas como LSP, Sintax Highlight e ferramentas de debug como debugpy e DAP, mas vou deixar aqui o link de algo que pode ajudar os usuários de coisas como LunarVim a irem pro caminho neovim only\n\nhttps://lnkd.in/dE2pyN8B\n\n#Neovim #VSCode #DX",
            "Vamo galera livro no precinho que o povo gosta...",
            "É oficial: #linkedisney virou zona\n\nAcho q pode ser culpa minha por sair aceitando conexão de geral, mas parece que minhas conexões só engajam com treta\n\nConteúdo técnico de uma semana não chega a metade de impressões de uma postagem de \"cagaç**\" de regra sobre interfaces em #Typescript.\n\nNão vai ter jeito, vou ter que mudar algumas coisas nesse perfil nos próxinos dias...",
            "É oficial: Minha rede no #linkedin gosta de confusâo.\n\nConteúdo \"técnico\" não chega nem a metade de \"cag*ção\" de regra que postei numa tarde de domingo....\n\nAcho q vou começar a botar ordem na casa....",
            "Domingão e hora da treta.\n\nInterfaces no #Typescript são mal implementadas pois possuem propriedades.\n\n#changemymind",
            "Agora sim ein.\n\nDepois de um mês caótico, estou de volta com mais um post sobre o vagabot no blog, dessa vez dando uma limpada no código que fiz antes e adicionando suporte a sqlite....\n\nDá uma conferida depois em https://lnkd.in/dxtijP7i\n\nE já adianto o futuro post vai ser como criar testes e2e para suas tranqueiras em Sqlite...\n\n#python #selenium #RPA",
            "Para os amigos, um dos exemplos pelo qual eu não ativo  compra por aproximação ou cartões via #NFC em meus devices....\n\nÉ uma tecnologia maravilhosa , mas ainda insegura, no máximo ativo esse tipo de compra pra momentos específicos...\n\nO Nubank tem o Modo Rua que provém certa proteção para altas transferências ou transferências suspeitas via #NFC",
            "Esse papo do CEO da #Nvidia de que não se vale a pena aprender programar hoje é cilada binho....\n\n1. Zero surpresa em o CEO da empresa que mais lucra com IA vender a IA como 4 revolução imdustrial\n\n2. Só acredito vendo: Demita TODOS os engenheiros de software da Nvidia e continue funciomando por um ano no mesmo rítimo de crescimento.\n\nNão vou ser negacionista aqui e negar inpactos e mudanças em mercado e produtividade por causa do uso proeminente de ferramemtas baseadas em IA, mão não me venha com essa de vender produto que reduz queda capilar como cura pra calvice....\n\nAgora senhores Devs e senhoras Devs, não se enganem.... Vão exogir mais produtividade de você, saber usar essas ferramentas a seu favor é o ideal, mas aprenda a não depender exclusivamente delas. IA automatiza o trabalho , então aprenda a fazê-lo sem automatizar para poder avaliar e aferir os resultados automatizados.",
            "Não sou fã do zod mas a dica é boa demais, sandys e juniors prestem atenção.... Eu ja vi API de gente grande no mercado não fazer tratamento de email, em algum lugar da internet tem um usuário cujo o email é um emoji de pokerface",
            "Hoje eu estava com um problema bizarro onde parecia que eu não podia mais gerenciar dispositivoa bluetooth, isto é adicionar, remover dispositivos ou conwctar com pareados.\n\nDetalhe eu não atualizei o PC nem nada, na segunda estava tudo normal, na terça não usei por causa do dayoff e na quarta boom.... Sem fone por um dia...\n\nFosse no meu maravilhoso veio de guerra #debian eu estaria analisando o comportamento do bluetooth, reinicinado o escambal do systemd , estaria tentando ver o comportamento via bluetoothctl e tudo mais....\n\nNo windows eu simplesmente acionei a solução de problemas que falhou em iniciar (Cômico demais ler: A solução de probelmas falhou em detectar o problema) , reiniciei e reinstalei drivers....\n\nE antes que falem mal do hardware é um Dell Vostro, geralmente esse tipo de device é bem estavél....",
            "Vendo aqui uns vídeos de #Elixir e #Phoenix e dá até vontade de mexer com desenvolvimento Web de novo...",
            "Eis que vc faz lambança em um projeto pessoal e fica perguntando quem fez a basteira, e ai usando git blame vc lembra que o culpado é vc....",
            "📍 ESTÁGIO DESENVOLVEDOR PYTHON📍\n\n🏠100%REMOTO\n\nOlá, rede! 💙\nOportunidades quentinhas\npara vocês, bora lá?!\nEmpresa: Minds Digital\n\nRequisitos necessário:\nConhecimento de Python 3.X.\nEstar cursando Engenharia de Software, Analise e Desenvolvimento de Sistemas, Ciência da Computação ou áreas afins de Tecnologia da Informação;\nDisponibilidade mínima de para 12 meses para o contrato de Estágio.\n\nDiferenciais Considerados\nConhecimento de APIs REST\nEntendimento de estruturação de banco de dados\nConhecimento de Git\nConhecimento de SQL\n\nContrato de Estágio;\nProposta inicial (A proposta vai depender da experiência e conhecimentos demonstrados durante o processo seletivo. Desta forma, conseguiremos entender melhor como poderá ser sua contribuição aqui. Procure compartilhar o máximo de informações com a gente e, também, nos perguntar tudo o que for importante para você);\nPlano de Saúde e Odontológico; (sem descontos)\nVA/VR (R$ 613,00);\nHorários Flexíveis;\nAuxílio Home Office;\nPLR;\nSubsídio de 50% em curso de inglês;\nSubsídio de 100% em certificações do Google;\nSeguro de Vida;\n\nSIGA OS ADMS:\n@rafaelcquevedo\n@diessicaquevedo\n@agenciai9whale\n\nGostou? 💙\n\nLink para se candidatar na vaga disponível no nosso aplicativo de vagas Oficial, link no primeiro comentário.\n\n🌟 Não perca a chance de decolar em sua carreira!\n\nJunte-se a nós no perfil @querovagas23 na rede vizinha e esteja sempre atualizado com as oportunidades de emprego que compartilhamos diariamente. 🚀\n\n\n📢 Os processos seletivos divulgados são de inteira responsabilidade das empresas recrutadoras.\n\n🔁 CURTA, COMENTE E COMPARTILHE. FAÇA ESSA VAGA CHEGAR A QUEM ESTÁ PROCURANDO.\n\n#oportunidades #devops #estagio #job #vagas #recolocação #sistemas #frontend #css3 #python #recolocacaoprofissional #vagas #javascript #networking #vagasdeemprego #ti #opentoWork #programadeestagio #css #segurançadainformação #empregov #consultor #reactnative #vagasti #desenvolvimento #python #analistadesistemas  #desenvolvedor #opentowork #vagasdeemprego #querovagas23",
            "Salve futuros operadores de #Delvin.\n\nContinuando a falar sobre o vagabot, segue a primeira de ao menos duas postagens no blog sobre o bot....\n\nNessa primeira parte eu mostro como criar containeres docker com selenium grid para operar navegadores de forma remota, e tanbém implemento a funcionalidade de logar no bot.\n\nSegue link\n\nhttps://lnkd.in/dDJGuSwq\n\n#python #docker #selenium",
            "Salve seres viventes da realidade simulada....\n\nOlha quem diria que mesmo testando o #vagabot daria resultado....\n\nAinda que tenha sido em um post antigo, esse foi de fato o meu primeiro teste com dados massivos.\n\nAinda falta algumas coisas pra ajustar, atualmente o maior problema é conseguir ignorar postagens com comentátrios bloqueados, estou pensando em ajustar para que nestes casoa seja feito um compartilhamento....\n\nO que acham?\n\n#vagabot #linkedisney #falhoucomsucesso",
            "Salve seres viventes e surtados do #linkedisney como cês tão?\n\nComo promessa é divida e eu não sou caloteiro está aqui o bot que prometi que ajuda as pessoas a buscarem vagas e interagir com elas\n\nMAS ANTES DE USAR UM AVISO:\nEu testei na minha conta, não sei as implicações legais ou punições sujeitas e não me responsabiliso, afinal trata-se de um experimento. Use com cautela.\n\nhttps://lnkd.in/dCD4Vgqz\n\nTá e como funciona essa jorça?\n\nExistem dois comandos implementados, um que busca postagens que supostamente são sobre vagas (De acordo com a query ) e outro comando pega essas postagens da base local gerada (sqlite) e sai comentando nessas postagens com a mensagem de sua escolha\n\nAinda falta muito refinamento, ajuste de features e implementações de edge cases como evitar postagens com comentários bloqueados, fora algumas limitações....\n\nPretendo ir atualizando este projeto ao longo do tempo e ver no que dá....\n\nEm breve posts sobre o desenvolvimento dessa brincadeira\n\n#seleniumautomation #python #poetry #docker #sqlite",
            "Tenho visto uma porrada de textão com 5 a 6 parágrafos e extremamente reflexivos aqui no #linkedisney\n\nNão tó criticando e nada contra quem faz isso (principalmente quem tá  usando IA)\n\nPor isso agora pra garantir o meu diferencial, eu só vou postar texto altoral expondo meus inúmeros erros de português e minhas pífias habilidades de escritor e vou chamar isso de \"diferencial\".\n\nO que acham?",
            "Por anos reclamei de muita coisa no ecosistema react, principalmente do péssimo suporte a promisses , pois bem parece que estamos a caminho de resolver não somente essa issue como outras que estão por vir.\n\nSe isso do hook use se comcretizar pretendo lançar uma lib em cima da fetch api pra content loading.\n\no que acham?\n\n#react #javascript #fetchAPI",
            "Novidades direto da minha fábrica de caos...\n\nUm bom domingo pra quem tá desenvolvendo bot pro linkedisney pra ajudar as sandys e juniores a ampliarem sua rede de forma \"orgânica\".\n\n#python #selenium #linkedin",
            "E vamos com mais um app de reconhecimento facial que não atende a necessidade de pessoas albinas\n\nA bola da vez o app #gov.br que   mesmo após eu ter registrado minha biometria de digital, após o ultimo update decidiu deslogar e agora exige reconhecimento facial.\n\nA ironia é que tirando a foto do mesmo lugar e intensidade de luz das vezes anteriorea ele simplesmente nâo funciona.\n\nAlém de ser um DESERVIÇO ao usuário obrigar o uso de reconhecimento facial.\n\nExistem outras formas de faxer isso como senhas de segurança autogeradas e populares em carteiras de criptomoedaa.\n\nEnfim mais um app que vou desinstalar por desrespeito ao usuário.\n\nParabéns aos envolvidos \n\nEdit: não contei a parte mais irônica... Eu uso o reconhecimento facial da samsung pra desbloquear a tela...",
            "Javeiros e Kotleiros(?) de plantão, me matem essa curiosidade aqui...\n\nExiste um equivalente no mundo #kotlin pra #JSP ?",
            "Inutilidade do dia pra quem ta buscando oportunidade:\n\nDesenvolvendo minhas loucuras de sexta a noite \"descobri\" que se você pesquisar por posts aparecem oportunidades interessantes pra juniors:\n\nex: \"vagas + oportunidade + temos + divulgando + desenvolvedor \"\n\nColoca na opção post como mostra o print abaixo e filtra pelas mais recentes",
            "Amigos , Amigas, Amigues e outros do #linkedin....\n\nSabem dizer se existe uma forma de buscar postagens sem ter que logar no #linkedin OU se há algum serviço ou api que me permita fazer esse tipo de consulta de forma LEGAL?"
        ]
    }
]